[{"name_latin": "Agaricus arvensis", "name_eng": "Horse Mushroom", "url": "http://www.mushroom.world/show?n=Agaricus-arvensis", "img_urls": ["http://www.mushroom.world/data/fungi/Agaricusarvensis1.JPG", "http://www.mushroom.world/data/fungi/Agaricusarvensis2.JPG", "http://www.mushroom.world/data/fungi/Agaricusarvensis3.JPG", "http://www.mushroom.world/data/fungi/Agaricusarvensis4.JPG", "http://www.mushroom.world/data/fungi/Agaricusarvensis5.JPG"], "description": "Cap 8-20 cm diameter, stem 8-10 cm tall * 2-3 cm diameter. Agaricus arvensis, commonly known as the horse mushroom, is a sometimes massive agaric that has a white cap, ringed stem, and pink or chocolate colored gills.\n\nCap white or cream colored, may have fine scales, first hemispherical in shape before flattening out with maturity. Flesh is white, firm and thick. Gills are at first white, becoming pink, then chocolate brown or blackish, free and crowded. Stem is white or cream; it is slightly club-shaped and smooth or finely scaly below the ring. Ring is white or cream, pendulous and superior. Viewed from below, on a closed-cap specimen, it has a well-developed 'cogwheel' pattern around the stem. \n\nSimilar species There are several similar species. Agaricus macrosporus are very fleshy, with scaly stem girdles. Agaricus sylvicola is a woodland variety. Agaricus augustus and Agaricus xanthoderma are also similar. Be careful not to confuse it with the deadly poisonous Amanita virosa, which has white gills.\n", "edibility": "edible and good "},
{"name_latin": "Amanita pantherina", "name_eng": "Panther Amanita", "url": "http://www.mushroom.world/show?n=Amanita-pantherina", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitapantherina1.jpg", "http://www.mushroom.world/data/fungi/Amanitapantherina2.jpg", "http://www.mushroom.world/data/fungi/Amanitapantherina3.jpg"], "description": "Cap 5-10 cm diameter, stem 8-12 cm tall * 1-1.5 cm diameter. Amanita pantherina, also known as the panther cap or panther amanita, is a medium to large fleshy agaric with brownish cap, pure white patches, white stem, ring, bulbous base with distinct margin.\n\nCap shiny brown or grey-brown with a very finely striate margin, initially domed, later flatten, with densely distributed warts that are pure white to sordid cream, minutely verruculose and easily removable. Gills free, close to crowded, white becoming greyish, truncate. Stem subcyclindric, somewhat narrowing upward, white, becoming slightly tannish in age, stuffed then hollow, finely floccose becoming smooth above the white ring that is initially quite chunky but often becomes thin and floppy in more mature specimens, sometimes with a toothed edge.\n\nAmanita pantherina on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Amanita muscaria", "name_eng": "Fly Amanita", "url": "http://www.mushroom.world/show?n=Amanita-muscaria", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitamuscaria1.JPG", "http://www.mushroom.world/data/fungi/Amanitamuscaria2.JPG", "http://www.mushroom.world/data/fungi/Amanitamuscaria3.JPG", "http://www.mushroom.world/data/fungi/Amanitamuscaria4.JPG", "http://www.mushroom.world/data/fungi/Amanitamuscaria5.JPG", "http://www.mushroom.world/data/fungi/Amanitamuscaria6.JPG"], "description": "Cap 8-10 cm diameter; stem 8-18 cm tall * 1-2 cm diameter. Amanita muscaria, commonly known as the fly agaric or fly amanita, is a medium to large, fleshy agaric, with red cap, white patches, white gills, ring and a bulbous base. It grows on poor and sandy soils and the fruiting bodies emerge from the soil looking like white eggs.\n\nCap first round to hemispherical, and finally to plate-like and flat in mature specimens, often with a low, shallow depression on disk when fully expanded. Surface shiny; deep scarlet, fading to orange-red or orange-yellow in older specimens. Gills white, free or barely touching the stem, crowded. Stem white, robust and has the slightly brittle, fibrous texture. At the base is a bulb that bears universal veil remnants in the form of two to four distinct rings or ruffs. Between the basal universal veil remnants and gills are remnants of the partial veil (which covers the gills during development) in the form of a white ring. It can be quite wide and flaccid with age. \n\nAmanita muscaria on the First Nature Web site.\n", "edibility": "poisonous"},
{"name_latin": "Amanita fulva", "name_eng": "Tawny grisette", "url": "http://www.mushroom.world/show?n=Amanita-fulva", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitafulva1.JPG", "http://www.mushroom.world/data/fungi/Amanitafulva2.JPG", "http://www.mushroom.world/data/fungi/Amanitafulva3.JPG", "http://www.mushroom.world/data/fungi/Amanitafulva4.JPG", "http://www.mushroom.world/data/fungi/Amanitafulva5.JPG", "http://www.mushroom.world/data/fungi/Amanitafulva6.JPG"], "description": "Cap 4-9 cm diameter, stem 7-12 cm tall * 0.8-1.2 cm diameter. Amanita fulva, also known as Tawny grisette, is a medium-sized agaric with distinctive tawny cap and white gills, no ring and usually without cap patches but with volval bag. It grows solitary or scattered on soil in mixed woodlands, favouring birch. Not recommended to be eaten because of danger to be mistaken with poisonous members of the Amanita genus. \n\nCap tan or orange-brown with sulcate margin, occasionally with brownish velar patches, at first ovoid, becoming expanded-convex and flattened with a slight umbo. Flesh white and brittle.\nStem whitish or pallid cap coulor, narrower towards the apex and arising from white volval bag. Ring absent. Hollow in marture specimens. \n\nSimilar species Amanita crocea and Amanita vaginata.\n\nAmanita fulva on the First Nature Web site.\n", "edibility": "inedible"},
{"name_latin": "Amanita ceciliae", "name_eng": "Snakeskin Grisette", "url": "http://www.mushroom.world/show?n=Amanita-ceciliae", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitaceciliae1.JPG", "http://www.mushroom.world/data/fungi/Amanitaceciliae2.JPG", "http://www.mushroom.world/data/fungi/Amanitaceciliae3.JPG", "http://www.mushroom.world/data/fungi/Amanitaceciliae4.JPG"], "description": "Cap 7-12 cm diameter, stem 8-13 cm tall * 1.5-2 cm diameter. The cap of this  large, grayish brown, fleshy agaric has charcoal-grey patches, which are easily removable and a scaly stem, white gills, and no ring or volval bag. It fruits during summer and autumn.\n\nCap is pallid gray-brown; shape ranging from convex to flat. It is upturned, and has a deep-coloured margin. There is a low umbo. Large, coarse, dingy gray patches decorate the volva. Flesh is white and firm. Gills are free and closely spaced, and white in colour. They can be thick, and are often forked. Stem is pallid, grayish brown with white shaggy horizontal bands of veil; an inconspicuous bulb is encased in a volval bag breaking away leaving slanting ridges. The mushroom has no ring.\n\nAmanita ceciliae on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Albatrellus ovinus", "name_eng": "Sheep Polypore", "url": "http://www.mushroom.world/show?n=Albatrellus-ovinus", "img_urls": ["http://www.mushroom.world/data/fungi/Albatrellusovinus1.JPG", "http://www.mushroom.world/data/fungi/Albatrellusovinus2.JPG", "http://www.mushroom.world/data/fungi/Albatrellusovinus3.JPG", "http://www.mushroom.world/data/fungi/Albatrellusovinus4.JPG", "http://www.mushroom.world/data/fungi/Albatrellusovinus5.JPG"], "description": "Cap 7-18 cm diameter, stem 3-7 cm tall * 1-3 cm thick. Albatrellus ovinus, also known as Sheep Polypore, is a creamy to pale gray-brown polypore that looks like an agaric or a hedgehog mushrooom from above, but it has minute pores on the underside. It stains lemon or greenish yellow, particularly on the pores. The skin of the convex cap often cracks with age. It has a sturdy stem and very firm, mild to slightly bitter white flesh. Grows under conifers, mycorrhizal with spruce on moss-covered soil.\n\nSimilar species Albatrellus confluens is more orange and does not stain yellow; it tastes bitter.\n\nAlbatrellus ovinus on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Albatrellus confluens", "name_eng": "", "url": "http://www.mushroom.world/show?n=Albatrellus-confluens", "img_urls": ["http://www.mushroom.world/data/fungi/Albatrellusconfluens1.JPG", "http://www.mushroom.world/data/fungi/Albatrellusconfluens2.JPG", "http://www.mushroom.world/data/fungi/Albatrellusconfluens3.JPG"], "description": "Cap 7-18 cm diameter, stem 3-7 cm tall * 1-3 cm thick. From above, this pale orange polypore looks like an agaric or a hedgehog mushrooom, but it has minute pores on the underside. The skin of the convex cap often cracks with age. It has a sturdy stem and very firm, mild to slightly bitter white flesh. Grows under conifers, mycorrhizal with conifers in a wide variety of ecosystems.\n\nSimilar species Albatrellus ovinus is more cream white and does stain yellow or greenish yellow, particularly on the pores.", "edibility": "inedible"},
{"name_latin": "Agaricus augustus", "name_eng": "The Prince", "url": "http://www.mushroom.world/show?n=Agaricus-augustus", "img_urls": ["http://www.mushroom.world/data/fungi/Agaricusaugustus1.jpg", "http://www.mushroom.world/data/fungi/Agaricusaugustus2.jpg", "http://www.mushroom.world/data/fungi/Agaricusaugustus3.jpg", "http://www.mushroom.world/data/fungi/Agaricusaugustus4.jpg"], "description": "Cap 10-20 cm diameter, stem 10-20 cm tall * 2-4 cm diameter. Agaricus augustus, also known as the prince, is a tall, sometimes massive agaric that has orange-brown scales on the surface of both cap and stem. Surfaces of all parts stain yellow when handled or bruised. \n\nCap hemispherical during the so-called button stage, and then expands, becoming convex and finally flat. The cap cuticle is dry, and densely covered with concentrically arranged, brown-coloured scales on a white to yellow background. The flesh is thick, firm and white and may discolour yellow when bruised. Gills are not attached to stem, crowded and pallid at first, and turn pink then dark brown with maturity. Stem Solid; cylindrical to club-shaped. The surface is white. Ring membranous, with patches of brownish fibrils under. \n\nSimilar species Agaricus subrefescens found in central and eastern U.S.\n\nAgaricus augustus on the First Nature Web site.\n", "edibility": "edible and good "},
{"name_latin": "Bankera fuligineoalba", "name_eng": "Blushing Flagrant Tooth", "url": "http://www.mushroom.world/show?n=Bankera-fuligineoalba", "img_urls": ["http://www.mushroom.world/data/fungi/Bankerafuligineoalba1.jpg"], "description": "Cap 5-10 cm diameter; stem 2-5 cm tall * 0.5-2 cm thick. This is a medium to large, fleshy to fibrous cap with spiny under surface. It is dark yellowish brown at center to yellowish pink or pinkish brown on margin. It becomes mush darker and quickly water-soaked in wet weather.\n\nCap convex at first, becoming flat or depressed at center. Margin thin, in-curved when young, lobed and wavy later. At first pallid, then brown with yellow or red tinges, remaining more pallid at the margin. Pine needles adhere to densely mattered surface fibrils.  The flesh is soft and brittle. Stem white at the apex, becoming dull brownish below, equal or tapered towards the base, downy, sometimes eccentric.", "edibility": "inedible"},
{"name_latin": "Auriscalpium vulgare", "name_eng": "Pinecone Tooth", "url": "http://www.mushroom.world/show?n=Auriscalpium-vulgare", "img_urls": ["http://www.mushroom.world/data/fungi/Auriscalpiumvulgare1.jpg", "http://www.mushroom.world/data/fungi/Auriscalpiumvulgare2.JPG"], "description": "Cap 1-2 cm diameter; stem 2-6 cm tall * 0.1-0.2 cm diameter. This mushroom is small to long medium sized, with a brown cap attached at one side or off center of the stem. The long, slender, stem rises from decaying pine cones.\n\nCap flat to rounded. Upper side brown to dark purplish brown, covered with dark brown fibrils. Under side spiny. Flesh thin, flexible. Spines light to dark brown.\nStem brown, hairy, rigid, joined laterally to the cap, swollen towards the base.\n\nAuriscalpium vulgare on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Armillaria mellea", "name_eng": "Honey Mushroom", "url": "http://www.mushroom.world/show?n=Armillaria-mellea", "img_urls": ["http://www.mushroom.world/data/fungi/Armillariamellea1.JPG", "http://www.mushroom.world/data/fungi/Armillariamellea2.JPG", "http://www.mushroom.world/data/fungi/Armillariamellea3.JPG", "http://www.mushroom.world/data/fungi/Armillariamellea4.JPG", "http://www.mushroom.world/data/fungi/Armillariamellea5.JPG", "http://www.mushroom.world/data/fungi/Armillariamellea6.JPG"], "description": "Cap 3-15 cm diameter, stem 6-15 cm tall * 0.5-1.5 cm thick. This large agaric has a convex, flattened, or wavy, olive-tinged, pale yellow-brown cap with a darker center and sparse pale scales. It grows in dense clusters on and around the stumps of leaf and coniferous trees.\n\nCap convex at first but becoming flattened, often with a central raised umbo, later becoming somewhat dish-shaped. The margins are often arched at maturity and the surface is sticky when wet. Though typically ochraceous, this fungus is rather variable in appearance and sometimes has a few dark, hairy scales near the centre somewhat radially arranged. The flesh white, thin and firm. Gills at first white, sometimes becoming pinkish-yellow or discoloured with age, broad and fairly distant, attached to the stipe at right angles or are slightly decurrent, crowded. The spore print is white. Stem at first whitish, becoming yellowish or reddish brown, more or less equal or tapering towards the base, finely wholly. The ring is yellowish, cottony or woolly, superior and fairly persistent.\n\nSimilar species The mushroom can be mistaken with Galerina marginata, which is deadly poisonous.\n\nArmillaria mellea on the First Nature Web site.\n", "edibility": "edible "},
{"name_latin": "Amanita virosa", "name_eng": "Destroying angel", "url": "http://www.mushroom.world/show?n=Amanita-virosa", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitavirosa1.JPG", "http://www.mushroom.world/data/fungi/Amanitavirosa2.JPG", "http://www.mushroom.world/data/fungi/Amanitavirosa3.JPG", "http://www.mushroom.world/data/fungi/Amanitavirosa4.JPG"], "description": "Cap 5-9 cm diameter, stem 13-20 cm tall * 1.5-2 cm diameter. Amanita virosa, also known as Destroying angel, is a lethally poisonous, medium large to large, white fleshy mushroom with a shaggy stalk and volval bag. It grows solitary or scattered on soil in broad-leaf or mixed woods.\n\nCap white to yellow in color, at first round to egg shaped, then flat but often retaining a flat umbo, usually with veil remnants at the margins. The flesh white and firm. Gills white (can turn yellow), free, crowded. Stem long and thread-like and has tufts above the ring and arising from large bag-like vulva often buried deep in the soil. The large ring sits high on the stem. Easily breaks and falls off and is produced by the inner veil.\n\nSimilar species Amanita bisporigera is a smaller, more slender, two-spored, but equally deadly mushroom. The mushroom can also be confused with edible Button mushrooms (Agaricus species). They have faint pink to brown gills, where Amanita virosa has white gills.\n", "edibility": "lethally poisonous"},
{"name_latin": "Amanita rubescens", "name_eng": "Blushing Amanita", "url": "http://www.mushroom.world/show?n=Amanita-rubescens", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitarubescens1.JPG", "http://www.mushroom.world/data/fungi/Amanitarubescens2.JPG", "http://www.mushroom.world/data/fungi/Amanitarubescens3.JPG", "http://www.mushroom.world/data/fungi/Amanitarubescens4.JPG", "http://www.mushroom.world/data/fungi/Amanitarubescens5.JPG"], "description": "Cap 6-15 cm diameter, stem 6-15 cm tall * 1-2.5 cm thick. This is a large, rosy-brown, fleshy agaric that has cap patches, white gills, a bulbous base and ring on stem. A significant characteristics is that it blush when bruised or cut, and is since also called the blusher. It grows solitary or scattered on soil in woods generally.\n\nCap pinkish brown with gray to pink patches on surface. At first it is sub-spherical, becoming convex and finally flattened. Flesh is moderately firm and white, becoming brownish pink where cut or damaged. Gills crowded, soft, white to off-white, free from stem, with pink tinges appearing on damaged areas. Spores are white. Stem downy, gray, white, or pink, bears a prominent pendent ring with furrows on it's upper surface. The base is swollen and girdled.\n\nAmanita rubescens on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Amanita regalis", "name_eng": "Royal Fly Agaric", "url": "http://www.mushroom.world/show?n=Amanita-regalis", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitaregalis1.JPG", "http://www.mushroom.world/data/fungi/Amanitaregalis2.JPG", "http://www.mushroom.world/data/fungi/Amanitaregalis3.JPG", "http://www.mushroom.world/data/fungi/Amanitaregalis4.JPG", "http://www.mushroom.world/data/fungi/Amanitaregalis5.JPG"], "description": "Cap 5-10 cm diameter, stem 6-12 cm tall * 1.5-2.5 cm thick. This is a medium to large, brown, fleshy agaric with cap patches, white gills, ring, basal bulb. Grows solitary or scattered on soil in mixed woods.\n\nCap brown; at first convex, becoming expanded-convex or flattened, smooth and slightly greasy in damp conditions, decorated with delicate, non-persistent, whitish or whitish grey velar patches. Flesh white firm and medium.\nGills are crowded close together, free from attachment to the stem, and white with a creamy yellow tinge. Stem white, smooth, lined above the ring. Ring large white and fairly firm, superior.\n", "edibility": "poisonous"},
{"name_latin": "Amanita porphyria", "name_eng": "Grey veiled amanita", "url": "http://www.mushroom.world/show?n=Amanita-porphyria", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitaporphyria1.JPG", "http://www.mushroom.world/data/fungi/Amanitaporphyria2.JPG", "http://www.mushroom.world/data/fungi/Amanitaporphyria3.JPG", "http://www.mushroom.world/data/fungi/Amanitaporphyria4.JPG", "http://www.mushroom.world/data/fungi/Amanitaporphyria5.JPG"], "description": "Cap 4-10 cm diameter; stem 5-12 cm tall * 1-1.5 cm diameter. This medium to large, fleshy agaric that has greyish brown cap, sometimes with grey patches, white gills, ring, bulbous base, grows near coniferous trees.\n\nCap hemispherical when young, later flat, greyish brown to brown in colour, usually smooth, sometimes with grey patches. Gills soft, crowded, white and free from the stem. Flesh is white with a smell of radish. Stem thick, smooth, white or pale yellow and has a grey to black ring. Has also a basal bulb. \n\nSimilar species Amanita porphyria can easily be confused with much more poisonous species such as the Panther cap (Amanita pantherina).\n\nAmanita porphyria on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Amanita phalloides", "name_eng": "Death Cap Amanita", "url": "http://www.mushroom.world/show?n=Amanita-phalloides", "img_urls": ["http://www.mushroom.world/data/fungi/Amanitaphalloides1.JPG", "http://www.mushroom.world/data/fungi/Amanitaphalloides2.jpg", "http://www.mushroom.world/data/fungi/Amanitaphalloides3.jpg", "http://www.mushroom.world/data/fungi/Amanitaphalloides4.jpg", "http://www.mushroom.world/data/fungi/Amanitaphalloides5.jpg"], "description": "Cap 6-12 cm diameter, stem 7-12 cm tall * 1 - 1.5 cm thick. This is a lethally poisonous, medium to large, fleshy agaric with greenish olive cap, whitish stem, ring, no patches but distinctive volval sheath. As the volva, which may be hidden by leaf litter, is a distinctive and diagnostic feature, it is important to remove some debris to check for it.\n\nCap at first round to egg-shaped and then flat. Varies greatly in colour from gray-white to green and yellow brown and has dark radial lines from the center. Sometimes with lots of veil remnants. Gills free, close, white, can turn yellow. Stem white with a scattering of grayish-olive scales and with a swollen, ragged, sac-like white volva (base). Ring white or colored like the stem, broad, thin, persistent.\n\nSimilar species Some Volvariella species look similar to older speciemens of Amanita phalloides. They are distinguished by a pale pink spore deposit and lack of a stem ring.\n\nAmanita phalloides on the First Nature Web site.", "edibility": "lethally poisonous"},
{"name_latin": "Tylopilus felleus", "name_eng": "Bitter Bolete", "url": "http://www.mushroom.world/show?n=Tylopilus-felleus", "img_urls": ["http://www.mushroom.world/data/fungi/Tylopilusfelleus1.JPG", "http://www.mushroom.world/data/fungi/Tylopilusfelleus2.JPG", "http://www.mushroom.world/data/fungi/Tylopilusfelleus3.JPG", "http://www.mushroom.world/data/fungi/Tylopilusfelleus4.JPG", "http://www.mushroom.world/data/fungi/Tylopilusfelleus5.JPG", "http://www.mushroom.world/data/fungi/Tylopilusfelleus6.JPG", "http://www.mushroom.world/data/fungi/Tylopilusfelleus7.JPG"], "description": "Cap 6-12 cm diamter, stem 7-10 cm tall * 2-3 cm diameter. Slightly to distinctly pink pores on the underside of the bun-shaped brown cap and a dark net on the thick stem are characteristic of this bolete. It is also distinguished by a very bitter taste.\n\nCap snuff- or fulvous-brown; convex or bun-shaped, at first slightly downy then smooth and dry. Flesh whitish, with pinkish tinge beneath cap cuticle, unchanging, thick and firm. Stem pallid background with brown reticulation, stout and slightly bulbous. The mushroom has no ring.\n\nSimilar species When young this is easily mistaken for Boletus edulis, except that it is very bitter and has a dark stem net.", "edibility": "inedible"},
{"name_latin": "Turbinellus floccosus", "name_eng": "Scaly Chanterelle", "url": "http://www.mushroom.world/show?n=Turbinellus-floccosus", "img_urls": ["http://www.mushroom.world/data/fungi/Turbinellusfloccosus1.jpg", "http://www.mushroom.world/data/fungi/Turbinellusfloccosus2.jpg"], "description": "5-15 cm diameter * 8-15 cm tall. This mushroom has an orange-capped vase- or trumpet-shaped fruiting body. The lower surface, the hymenium, is covered in wrinkles and ridges rather than gills or pores, and is pale buff or yellowish to whitish.\n\nFruiting body initially cylindrical, maturing to trumpet- or vase-shaped. There is no clear demarcation between the cap and stipe. The stripe it is solid in younger specimens, though is often hollowed out by insect larvae in older. At higher elevations, two or three fruit bodies may arise from one stipe. Colored various shades of reddish- to yellowish-orange, the cap surface is broken into scales, with the spaces between more yellow and the scales themselves more orange. The white flesh is fibrous and thick, though thins with age. Somewhat brittle, it can sometimes turn brown when cut or bruised. Spores are brownish.\n\nSimilar species The related Turbinellus kauffmanii is similar-looking but has a pale brown cap. Younger specimens of the latter species also have a pungent smell. Turbinellus fujisanensis, found in Japan, is another lookalike that has smaller spores than Turbinellus floccosus.\n", "edibility": "inedible"},
{"name_latin": "Tricholomopsis rutilans", "name_eng": "Plums and Custard", "url": "http://www.mushroom.world/show?n=Tricholomopsis-rutilans", "img_urls": ["http://www.mushroom.world/data/fungi/Tricholomopsisrutilans1.JPG", "http://www.mushroom.world/data/fungi/Tricholomopsisrutilans2.JPG", "http://www.mushroom.world/data/fungi/Tricholomopsisrutilans3.JPG", "http://www.mushroom.world/data/fungi/Tricholomopsisrutilans4.JPG", "http://www.mushroom.world/data/fungi/Tricholomopsisrutilans5.JPG"], "description": "Cap 2-12 cm diameter; stem 3.5-5.5 cm tall * 1-1.5 cm diameter. This medium to large, fleshy agaric has a cap with plum fibrils on custard yellow backround and gills are egg -yellow, which makes it easily recognised. It grows solitary or in small caespitose tufts on or close to rotting conifer stumps.\n\nCap plum-red scaled cap with yellow base colour. At first convex, becoming broadly umbonate. Gills egg -yellow, adnexed, broad, crowded. Stem yellow and covered with reddish purple, fibrillose scales, less densely than on cap, more or less equal. Flesh pallid yellow, tough, stuffed or full. \nStem cylindrical and with a red scaly base developing to a yellow colour towards the cap. It has no ring or volva.", "edibility": "inedible"},
{"name_latin": "Tricholomopsis decora", "name_eng": "Yellow Rider", "url": "http://www.mushroom.world/show?n=Tricholomopsis-decora", "img_urls": ["http://www.mushroom.world/data/fungi/Tricholomopsisdecora1.JPG", "http://www.mushroom.world/data/fungi/Tricholomopsisdecora2.JPG", "http://www.mushroom.world/data/fungi/Tricholomopsisdecora3.JPG", "http://www.mushroom.world/data/fungi/Tricholomopsisdecora4.JPG"], "description": "Cap 4-12 cm diameter, stem 3.5-5.5 cm tall * 1-1.5 cm thick. This is a medium to large, fleshy agaric, cap with brown fibrils on a predominantly yellow background with brown to blackish scales, thinning towards the margin.\n\nCap egg-yellow, densely covered with brownish, firbrillose scales thinning towards the margin; at first convex, becoming broadly umbonate. Flesh pallid yellow and thin. Gills egg-yellow, adnexed very broad, crowded. Spores Spore print white. Stem yellow and covered with brownish, fibrillose scales, less densely than on cap, more or less equal. The mushroom has no ring.", "edibility": "inedible"},
{"name_latin": "Tricholoma sejunctum", "name_eng": "False Edible Trich", "url": "http://www.mushroom.world/show?n=Tricholoma-sejunctum", "img_urls": ["http://www.mushroom.world/data/fungi/Tricholomasejunctum1.jpg", "http://www.mushroom.world/data/fungi/Tricholomasejunctum2.JPG", "http://www.mushroom.world/data/fungi/Tricholomasejunctum3.JPG", "http://www.mushroom.world/data/fungi/Tricholomasejunctum4.JPG"], "description": "Cap 4-10 cm diameter. The green or brown cap of this agaric is moist and domed and flattening with age. It's surface has dark fibrils and is greasy in wet weather. It causes nausea if eaten.\n\nCap pallid, yellowish with fine, brownish or tan, radiating fibrils; at first convex, becoming flattened, with broad umbo, slightly sticky. Flesh off-white, tinted yellow under the cap skin. Gills whitish ochre, emarginate, very broad, crowded. Stem coloured as cap, but more pallid, smooth, more or less equal or tapering upwards. It develops yellow flushes with age. The mushroom has no ring.\n\nSimilar species Tricholoma portentosum has darker hat, and Tricholoma arvernense grows in coniferous forest. The poisonous Amanita phalloides is distinguished by it's volva, stem ring, and free gills.", "edibility": "inedible"},
{"name_latin": "Tricholoma saponaceum", "name_eng": "Soapy Trich", "url": "http://www.mushroom.world/show?n=Tricholoma-saponaceum", "img_urls": ["http://www.mushroom.world/data/fungi/Tricholomasaponaceum1.jpg", "http://www.mushroom.world/data/fungi/Tricholomasaponaceum2.jpg"], "description": "Cap 5-10 cm diameter; stem 5-10 cm tall * 1-3 cm diameter. This is a medium to large agaric, whose hat is rounded to flattened, often humped. Cap usually tinged with olive; may be brownish on disc center. Gills close. Stalk thick; stains reddish when bruised.\n\nCap convex, becoming broadly convex or flat, often with a low, broad, rounded hump. Outline typically has irregular lobes or folds and splits. Cap occasionally is off center of stem. Color varies between grayish green, yellowish green, gray, blackish, copper colored, or brownish. Gills white, becoming reddish spotted, emarginate, fairly distant. Stem mor or less equal or slightly thicker below, sometimes tapered at base; often bent. Surface smooth to fibrillose or minutely scaly; white of weakly flushed with cap colors, brownish pink at base.", "edibility": "inedible"},
{"name_latin": "Tricholoma focale", "name_eng": "", "url": "http://www.mushroom.world/show?n=Tricholoma-focale", "img_urls": ["http://www.mushroom.world/data/fungi/Tricholomafocale1.JPG", "http://www.mushroom.world/data/fungi/Tricholomafocale2.JPG", "http://www.mushroom.world/data/fungi/Tricholomafocale3.JPG", "http://www.mushroom.world/data/fungi/Tricholomafocale4.JPG", "http://www.mushroom.world/data/fungi/Tricholomafocale5.JPG"], "description": "Cap 5-10 cm diameter, stem 6-8 cm tall * 1-1.5 cm thick. This medium-sized, fleshy agaric is orange-brown to reddish-brown with cream gills and a distinctively banded stem. It grows scattered or in small trooping groups on soil with pines in coastal locations.\n\nCap Orange-brown to reddish-brown, cracking as it ages; convex, developing a flat top, margin inrolled. Gills white, browning on gill edges with age; adnexed to free; moderately distant. Stem white and smooth above shaggy ring, patterned with bands of large brown scales below; tapering continuously towards the base.", "edibility": "inedible"},
{"name_latin": "Tricholoma flavovirens", "name_eng": "Edible Yellow Trich", "url": "http://www.mushroom.world/show?n=Tricholoma-flavovirens", "img_urls": ["http://www.mushroom.world/data/fungi/Tricholomaflavovirens1.jpg", "http://www.mushroom.world/data/fungi/Tricholomaflavovirens2.jpg"], "description": "Cap 5-14 cm diameter, stem 5-10 cm tall * 1.5-2.5 cm diameter. This is an agaric with medium to large cap; vivid yellow, brown at center; no black streaks or fibrils. Gills yellow.\nCap broadly convex or nearly flat, with an inrolled margin at first; expanding to broadly convex or flat, often with a broad, low, central hump. Pale yellow at first, then greenish yellow to vivid yellow and usually remaining yellow on margin but gradually becoming brown from disk center outward. Flesh thick, firm; white or tinged with yellow under cuticle. Gills notched around apex of stem, close, broad; edges become ragged with age. Gills attached to the stem, often by means of a notch; close, bright yellow, not staining when bruised. Stem more or less equal, or enlarged at base; solid or hollowed in age. Surface smooth to fibrillose; pale to light yellow.\n\nSimilar species Be sure to distinguish from Tricholoma sulphureum and from Tricholoma sejunctum, both of which are poisonous.", "edibility": "edible "},
{"name_latin": "Suillus variegatus", "name_eng": "Variegated Bolete", "url": "http://www.mushroom.world/show?n=Suillus-variegatus", "img_urls": ["http://www.mushroom.world/data/fungi/Suillusvariegatus1.JPG", "http://www.mushroom.world/data/fungi/Suillusvariegatus2.JPG", "http://www.mushroom.world/data/fungi/Suillusvariegatus3.JPG", "http://www.mushroom.world/data/fungi/Suillusvariegatus4.JPG", "http://www.mushroom.world/data/fungi/Suillusvariegatus5.JPG"], "description": "Cap 6-13 cm diameter, stem 5-9 cm tall * 1.5-2 cm thick. Tall-stemmed and fleshy, the Suillus variegatus rarely exhibits the slimminess that is characteristic of the genus suillus.\n\nCap sandy to rusty brown coloured. At first ovate and then convex. The skin can be removed. It has a freckly, downy surface in dry weather. Flesh pallid ochraceous and turns blue when cut and thumbed. Pores at first ochraceous with olivaceous tinge, becoming more cinnamon-brown with age, sometimes bluish where bruised. Tubes are dark ochraceous or buff, adnate. Stem smooth and firm. Mottled yellow to a brown yellow and thicker at the base. The mushroom has no ring.\n\nSimilar species Suillus tomentosus is the equivalent species in western North America.\n", "edibility": "edible "},
{"name_latin": "Suillus luteus", "name_eng": "Slippery Jack Bolete", "url": "http://www.mushroom.world/show?n=Suillus-luteus", "img_urls": ["http://www.mushroom.world/data/fungi/Suillusluteus1.JPG", "http://www.mushroom.world/data/fungi/Suillusluteus2.JPG", "http://www.mushroom.world/data/fungi/Suillusluteus3.JPG", "http://www.mushroom.world/data/fungi/Suillusluteus4.JPG", "http://www.mushroom.world/data/fungi/Suillusluteus5.JPG"], "description": "Cap 5-10 cm diameter, stem 5-10 cm tall * 2-3 cm thick. This is a medium to large bolete with slimy, brown cap. It's short to stubby stalk has brown dots and a well-developed ring.\nCap chestnut, rusty, olive brown, or dark brown in color. It has a distinctive conical shape, later flattening out. It is slimy to the touch, bare, smooth, and glossy even when dry, and the cuticle is easily peeled off.  Flesh whitish with yellow tinge, unchanging, moderate and soft, unchanging when cut. Pores tiny, circular, initially yellow but turn olive to dark yellow with maturity. Like the skin of the cap, they can be readily peeled away from the flesh. Tubes concolorous with pores, adnate. Spores Ocher-brown. Stem Cylindrical or tapered downwards and solid. Yellow and dotted above ring but whitish below, especially at base. Ring at first whitish, darkening with age, vinaceous-brown below and large.\n\nSuillus luteus on the Nature First Web site.\n", "edibility": "edible and good "},
{"name_latin": "Suillus grevillei", "name_eng": "Larch Bolete", "url": "http://www.mushroom.world/show?n=Suillus-grevillei", "img_urls": ["http://www.mushroom.world/data/fungi/Suillusgrevillei1.JPG", "http://www.mushroom.world/data/fungi/Suillusgrevillei2.JPG", "http://www.mushroom.world/data/fungi/Suillusgrevillei3.JPG", "http://www.mushroom.world/data/fungi/Suillusgrevillei4.JPG", "http://www.mushroom.world/data/fungi/Suillusgrevillei5.JPG", "http://www.mushroom.world/data/fungi/Suillusgrevillei6.JPG", "http://www.mushroom.world/data/fungi/Suillusgrevillei7.JPG"], "description": "Cap 3-10 cm diameter, stem 5-7 cm tall * 1.5-2 cm diameter. This vividly colored bolete grows with larch trees in woods. The mushroom is slimy, with yellow cap, small pores and whitish ring on stem.\n\nCap colored from citrus yellow to burnt orange, at first hemispherical, then bell-shaped, and finally flattened. It has a sticky skin, short tubes of yellow or brownish which descend down to the bottom of its cylindrical stalk. It is sticky or viscid when damp. Flesh is pallid lemon-yellow, unchanging, moderate, soft. Pores at first pallid lemon-yellow, becoming more ochraceous and tinged rust where bruised, angular, small. Tubes pallid yellow and slightly decurrent. Spores Yellowish brown. Stem cream-colored turning to reddish brown with a cream-white ring which is superior and pointing upwards.", "edibility": "edible "},
{"name_latin": "Suillus bovinus", "name_eng": "Euro Cow Bolete", "url": "http://www.mushroom.world/show?n=Suillus-bovinus", "img_urls": ["http://www.mushroom.world/data/fungi/Suillusbovinus1.JPG", "http://www.mushroom.world/data/fungi/Suillusbovinus2.JPG", "http://www.mushroom.world/data/fungi/Suillusbovinus3.JPG", "http://www.mushroom.world/data/fungi/Suillusbovinus4.JPG", "http://www.mushroom.world/data/fungi/Suillusbovinus5.JPG"], "description": "Cap 3-10 cm diameter, stem 4-6 cm tall * 0.5-1 cm thick. This usually small, orange-rusty brown bolete, with it's convex to flat cap and short, ringless stem, is notable for it's compound pores: the olive-green pore layer has an outer layer of coarse; angular pores and an inner layer of fine pores.\n\nCap ochraceous or pinkish clay, more pallid at margin; convex or bun-shaped, smooth, sticky or viscid when damp. Flesh white with pinkish clay tinge, thick and soft. Pores at first pallid olive or buff, becoming more ochraceous with age, angular, compound, unequal, large. Tubes grayish with vinaceous tinge, more or less decurrent. Spores brownish olive. Stem pallid yellowish sienna, more or less equal or tapering at base. Ring absent.", "edibility": "edible "},
{"name_latin": "Stropharia hornemannii", "name_eng": "", "url": "http://www.mushroom.world/show?n=Stropharia-hornemannii", "img_urls": ["http://www.mushroom.world/data/fungi/Strophariahornemannii1.JPG", "http://www.mushroom.world/data/fungi/Strophariahornemannii2.JPG", "http://www.mushroom.world/data/fungi/Strophariahornemannii3.JPG", "http://www.mushroom.world/data/fungi/Strophariahornemannii4.JPG", "http://www.mushroom.world/data/fungi/Strophariahornemannii5.JPG", "http://www.mushroom.world/data/fungi/Strophariahornemannii6.JPG"], "description": "Cap 6-15 cm diameter, stem 6-12 cm tall * 1-2 cm thick. This is a medium-sized to large agaric with a large slimy purple or olive cap whose gills become purple with age. The stalk is long and richly decorated with pieces of the white sheath that extends up to a prominent ring.", "edibility": "poisonous"},
{"name_latin": "Strobilurus stephanocystis", "name_eng": "", "url": "http://www.mushroom.world/show?n=Strobilurus-stephanocystis", "img_urls": ["http://www.mushroom.world/data/fungi/Strobilurusstephanocystis1.JPG", "http://www.mushroom.world/data/fungi/Strobilurusstephanocystis2.JPG", "http://www.mushroom.world/data/fungi/Strobilurusstephanocystis3.JPG"], "description": "Cap 1-2 cm diameter, stem 2-7 cm tall * 0.1-0.2 cm thick. This small, delicate agaric with tawny-brown cap and whitish gills grows solitary or in small groups, attached to buried or partly buried pine cones.\n\nCap brown or tawny; at first convex, becoming flattened, smooth. Flesh white and thin. Gills whitish cream, adnexed and crowded. Stem pallid and coloured as cap, finely silky-pruinose, tapering slightly upwards, typically deeply rooting. The mushroom has no ring. Flesh white, fragile and hollow.", "edibility": "inedible"},
{"name_latin": "Strobilurus esculentus", "name_eng": "Distant-gill Cone Collybia", "url": "http://www.mushroom.world/show?n=Strobilurus-esculentus", "img_urls": ["http://www.mushroom.world/data/fungi/Strobilurusesculentus1.JPG", "http://www.mushroom.world/data/fungi/Strobilurusesculentus2.JPG", "http://www.mushroom.world/data/fungi/Strobilurusesculentus3.JPG"], "description": "Cap 1-2 cm diameter, stem 2-7 cm tall * 0.1-0.2 cm thick. This small, delicate agaric with brown, conical cap and whitish gills grows solitary or in small groups, attached to buried or partly buried spruce cones. Note: this species never occurs on pine cones.\n\nCap brownish grey, convex, becoming flattened, smooth. Flesh white and thin. It can also be off-white or brownish-black. Gills crowded, white, and somewhat sinuate. The spores are white.  Stem brownish grey with a pale apex.", "edibility": "inedible"},
{"name_latin": "Sarcodon squamosus", "name_eng": "Scaly Tooth", "url": "http://www.mushroom.world/show?n=Sarcodon-squamosus", "img_urls": ["http://www.mushroom.world/data/fungi/Sarcodonsquamosus1.JPG", "http://www.mushroom.world/data/fungi/Sarcodonsquamosus2.JPG", "http://www.mushroom.world/data/fungi/Sarcodonsquamosus3.JPG", "http://www.mushroom.world/data/fungi/Sarcodonsquamosus4.JPG", "http://www.mushroom.world/data/fungi/Sarcodonsquamosus5.JPG"], "description": "Cap 10-25 cm diameter, stem 4-7 cm tall * 2-4 cm thick. This large mushroom has a coarsely scaly, pale brown cap with dark grayish, spiny under-surface. It grows with pines solitary or in scattered groups, on soil in coniferous woods.\n\nFruiting body pale brown, decorated with coarse darker gray scales, erect at the centre, more flattened towards the incurved margin, arranged in concentric rows. It is at first shallowly convex, then flattened or slightly depressed at the centre; at first whitish, becoming gray, remaining pallid at the base, equal or somewhat clavate towards the base, downy. Flesh white, thick in the cap centre, firm, full in stem. Spines 4 to 10mm long, decurrent, white or pale buff, turning purple-brown with age.", "edibility": "edible "},
{"name_latin": "Russula xerampelina", "name_eng": "Crab Russula", "url": "http://www.mushroom.world/show?n=Russula-xerampelina", "img_urls": ["http://www.mushroom.world/data/fungi/Russulaxerampelina1.JPG", "http://www.mushroom.world/data/fungi/Russulaxerampelina2.jpg"], "description": "Cap 5-14 cm diameter; stem 3-11 cm tall * 1-3 cm diameter. This is a medium to large agaric, hard-fleshed cap; color varies, often dark red or purple. Mature plats have a fishy odor. All parts slowly stain dingy yellow-brown when cut or bruised.\nCap convex, becoming later flat, with a broad, shallow depression. Surface sticky when moist, but soon dry; smooth - not streaked or warty. Color most often dark red, but may be dark purple, pink, green or brown, often with traces of yellow. Gills broad, close to subdistant, adnate, yellowish white. Stem solid at first, later spongy. Surface white or flushed with pink; dry, smooth to wrinkled.", "edibility": "edible "},
{"name_latin": "Russula paludosa", "name_eng": "Tall Bog Russula", "url": "http://www.mushroom.world/show?n=Russula-paludosa", "img_urls": ["http://www.mushroom.world/data/fungi/Russulapaludosa1.JPG", "http://www.mushroom.world/data/fungi/Russulapaludosa2.JPG", "http://www.mushroom.world/data/fungi/Russulapaludosa3.JPG", "http://www.mushroom.world/data/fungi/Russulapaludosa4.JPG", "http://www.mushroom.world/data/fungi/Russulapaludosa5.JPG", "http://www.mushroom.world/data/fungi/Russulapaludosa6.JPG"], "description": "Cap 5-14 cm diameter, stem 5-14 cm tall * 1-3 cm thick. Taller than most, this large, attractive Russula species has a convex to depressed, orange-red cap, with yellow discoloration in the center and a slightly sticky surface when damp.\n\nCap variable, reddish with apricot, bay, blood or scarlet tinges; at first convex, later flattened and depressed, shiny or somewhat sticky when damp, cuticle peeling halfway to center.  Flesh white, moderate, granular and brittle. Gills are cream or pallid ochraceous, adnexed, brittle, narrow, strongly interveined. Spores pale ocher. Stem white or tinged pink, more or less equal or tapering slightly upwards, smooth. Ring absent. Flesh white, fragile and stuffed.\n\nSimilar species The poisonous and hot-tasting Russula emetica has no yellow coloring on the cap.", "edibility": "edible "},
{"name_latin": "Russula obscura", "name_eng": "", "url": "http://www.mushroom.world/show?n=Russula-obscura", "img_urls": ["http://www.mushroom.world/data/fungi/Russulaobscura1.JPG", "http://www.mushroom.world/data/fungi/Russulaobscura2.JPG", "http://www.mushroom.world/data/fungi/Russulaobscura3.JPG", "http://www.mushroom.world/data/fungi/Russulaobscura4.JPG", "http://www.mushroom.world/data/fungi/Russulaobscura5.JPG"], "description": "Cap 5-14 cm diameter, stem 6-12 cm tall * 1-3 cm thick. Russula obscura, also known as Russula vinosa, is a medium sized agaric mostly found with pine.\n ", "edibility": "edible "},
{"name_latin": "Russula emetica", "name_eng": "The Sickener", "url": "http://www.mushroom.world/show?n=Russula-emetica", "img_urls": ["http://www.mushroom.world/data/fungi/Russulaemetica1.JPG", "http://www.mushroom.world/data/fungi/Russulaemetica2.JPG", "http://www.mushroom.world/data/fungi/Russulaemetica3.JPG", "http://www.mushroom.world/data/fungi/Russulaemetica4.JPG", "http://www.mushroom.world/data/fungi/Russulaemetica5.JPG", "http://www.mushroom.world/data/fungi/Russulaemetica6.JPG"], "description": "Cap 3-10 cm diameter, stem 4-9 cm tall * 0.7-2 cm thick. Russula emetica, also know as The Sickener, is a medium-sized agaric that has a convex to slightly depressed, sharlet-red cap. It grows mainly with coniferous trees in boggy areas. It is not highly poisonous and has a very hot taste.\n \nCap convex to slightly depressed, and often shiny scarlet or cherry red, becoming sticky at wet. Gills are whitish, becoming pallid straw, more or less free, brittle, and narrow. Spores are white. Stem white, club shaped with a scurfy skin.\n\nSimilar species Russula silvicola is the common dry woodland species across North America. Russula fageticola usually grows under beech trees, and it also tastes hot. Amanita muscaria has veil patches on the cap, a stem ring, and a bulb.\n", "edibility": "poisonous"},
{"name_latin": "Russula decolorans", "name_eng": "Copper Brittlegill", "url": "http://www.mushroom.world/show?n=Russula-decolorans", "img_urls": ["http://www.mushroom.world/data/fungi/Russuladecolorans1.JPG", "http://www.mushroom.world/data/fungi/Russuladecolorans2.JPG", "http://www.mushroom.world/data/fungi/Russuladecolorans3.JPG", "http://www.mushroom.world/data/fungi/Russuladecolorans4.JPG", "http://www.mushroom.world/data/fungi/Russuladecolorans5.JPG"], "description": "Cap 4.5-11 cm diameter, stem 4.5-10 cm tall * 1-2.5 cm thick. Russula decolorans, also know as Copper Brittlegill, is a medium to large agaric that has a distinctively colored orange-brown cap, pale yellow gills and white stem. All parts of the mushroom is graying or blackening.\n\nCap as young almost completely round, then convex to flat, often with a depressed center. At fist bright orange-yellow, then more subdued brick-red, sometimes with a darker center. Sticky in damp weather, and has smooth skin that can be removed. Gills at first white, then creamy yellow and finally gray. Reaching but not attached to the stem. Stem is white, graying readily when bruised or with age, more or less equal or somewhat club-shaped, stout, and smooth. The mushroom has no ring.\n\nSimilar species other Russula species.", "edibility": "edible "},
{"name_latin": "Russula claroflava", "name_eng": "Yellow Swamp Brittlegill", "url": "http://www.mushroom.world/show?n=Russula-claroflava", "img_urls": ["http://www.mushroom.world/data/fungi/Russulaclaroflava1.JPG", "http://www.mushroom.world/data/fungi/Russulaclaroflava2.JPG", "http://www.mushroom.world/data/fungi/Russulaclaroflava3.JPG", "http://www.mushroom.world/data/fungi/Russulaclaroflava4.JPG", "http://www.mushroom.world/data/fungi/Russulaclaroflava5.JPG", "http://www.mushroom.world/data/fungi/Russulaclaroflava6.JPG"], "description": "Cap 4-10 cm diameter, stem 4-10 cm tall * 1-2 cm thick. Russula claroflava, also known as Yellow Swamp Brittlegill, is a brightly coloured agaric that has a convex to flat, vivid yellow cap. It grows with birch in very damp of boggy woodland.\n\nCap  bright yellow in colour, which diminishes with age, and slightly sticky when damp. It has a thin, smooth skin that can easily be peeled off and often a depressed center. Gills at first white, then creamy yellow. Older ones can have gray or black edges,  more or less free or reaching but not connected to the stem and fairly crowded. Stem is white, turns gray with age, more or less equal, fairly stout, and smooth. The mushroom has no ring.\n\nSimilar species Russula claroflava has a stem that grays strongly on bruising. Russula ochroleuca has a green tinge on the cap. Russlula ochroleucoides is a bitter-tasting American equivalent, growing in East Coast oak woods.", "edibility": "edible "},
{"name_latin": "Russula aeruginea", "name_eng": "Green Brittlegill", "url": "http://www.mushroom.world/show?n=Russula-aeruginea", "img_urls": ["http://www.mushroom.world/data/fungi/Russulaaeruginea1.JPG", "http://www.mushroom.world/data/fungi/Russulaaeruginea2.JPG", "http://www.mushroom.world/data/fungi/Russulaaeruginea3.JPG", "http://www.mushroom.world/data/fungi/Russulaaeruginea4.JPG"], "description": "Cap 4-9 cm diameter, stem 4-8 cm tall * 0.7-2 cm thick. Russula aeruginea, also known as Green Brittlegill, has a convex to depressed green cap that is often marked with rust- to red-brown spots and frequently has furrows at the margin. It grows solitary or in scattered groups on soil under birch.\n\nCap flat when young, soon funnel shaped and weakly striped; somewhat sticky and shiny, pale green to light grey-green, more rarely olive green. Flesh white, moderately thick, granular and brittle. Gills buff, becoming yellowish tinged, adnexed, forked, fairly narrow and crowded. Stem white, sometimes with rust spotting, more or less equal, smooth. Flesh white, fairly firm but brittle and full. Spores are cream-yellow colored. The mushroom has no ring.\n\nSimilar species Russula heterophylla has former flesh. The cap of Russula virescens has small scales. Both are mild tasting. Can also be confused with the deadly poisonous Amanita phalloides with has a ring and is not a Russula.\n\nNote the mushroom, as all other mushrooms with green cap, is not recommend to be eaten because it can be confused with the deadly poisonous Amanita phalloides (Death Cap).\n\nRussula aeruginea on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Russula acrifolia", "name_eng": "", "url": "http://www.mushroom.world/show?n=Russula-acrifolia", "img_urls": ["http://www.mushroom.world/data/fungi/Russulaacrifolia1.JPG", "http://www.mushroom.world/data/fungi/Russulaacrifolia2.JPG"], "description": "Cap 5-20 cm diameter, stemp 2-8 cm tall * 1-4 cm thick. ", "edibility": "inedible"},
{"name_latin": "Rickenella swartzii", "name_eng": "", "url": "http://www.mushroom.world/show?n=Rickenella-swartzii", "img_urls": ["http://www.mushroom.world/data/fungi/Rickenellaswartzii1.JPG", "http://www.mushroom.world/data/fungi/Rickenellaswartzii2.JPG", "http://www.mushroom.world/data/fungi/Rickenellaswartzii3.JPG", "http://www.mushroom.world/data/fungi/Rickenellaswartzii4.JPG"], "description": "Cap 0.5-1 cm diameter, stem 2-4 cm tall * 0.1-0.2 cm thick. Rickenella swartzii is a tiny agaric that is pale fray to gray-brown. The cap center (navel) is almost black. The top of the stem is tinged dark violet. It grows in scattered trooping groups in lawns and other grasslands, typically with moss.", "edibility": "inedible"},
{"name_latin": "Rhizina undulata", "name_eng": "Pine firefungus", "url": "http://www.mushroom.world/show?n=Rhizina-undulata", "img_urls": ["http://www.mushroom.world/data/fungi/Rhizinaundulata1.JPG", "http://www.mushroom.world/data/fungi/Rhizinaundulata2.JPG", "http://www.mushroom.world/data/fungi/Rhizinaundulata3.JPG"], "description": "2-10 cm diameter. Rhizina undulata, also know as Pine firefungus, is a large, irregular, brown or black fungus that grows in fused clusters on conifer debris, particularly in old fire sites.\n\nFruiting bodyflat, with irregular lobes, and attached to the growing surface on the entire lower side by numerous whitish to yellowish rhizoids resembling plants roots. The margin is pale yellow (like the underside), and wavy and irregular. Surface sticky as moist. Flesh is reddish brown, tough and thick.\nOccurrence It is grows infrequently from early summer to early autumn.\n", "edibility": "inedible"},
{"name_latin": "Psilocybe semilanceata", "name_eng": "Liberty Cap", "url": "http://www.mushroom.world/show?n=Psilocybe-semilanceata", "img_urls": ["http://www.mushroom.world/data/fungi/Psilocybesemilanceata1.JPG", "http://www.mushroom.world/data/fungi/Psilocybesemilanceata2.JPG", "http://www.mushroom.world/data/fungi/Psilocybesemilanceata3.JPG", "http://www.mushroom.world/data/fungi/Psilocybesemilanceata4.JPG", "http://www.mushroom.world/data/fungi/Psilocybesemilanceata5.JPG", "http://www.mushroom.world/data/fungi/Psilocybesemilanceata6.jpg"], "description": "Cap 0.5-1.5 cm diameter, stem 2.5-7 cm tall * 0.1-0.2 cm thick. Psilocybe semilanceata, also known as Liberty Cap, is a hallucinogenic mushroom that contains the psychoactive compounds psilocybin. It has a distinctive yellowish pointed cap, clay or dark brown gills, and long slender stem. It grows in scattered trooping groups, on soil amongst grass in lawns and pastures favoring hilly sites.\n \nCap pallid ochraceous-brown, hygrophanous, drying buff and varies in shape from sharply conical to bell-shaped, often with a prominent papilla. It does not change shape considerably as it ages. The cap margin is initially rolled inward but unrolls to become straight or even curled upwards in maturity. Gills moderately crowded together, and they have a narrowly adnexed to almost free attachment to the stem. Spores are purplish brown. Stem slender yellowish-brown and usually slightly thicker towards the base.\n\nSimilar species Psilocybe fimetaria has a white veil at the margin. It grows in horse manure. There are also several other species the mushroom can be confused with.\n\nPsilocybe semilanceata on the www.first-nature.com web site.", "edibility": "inedible"},
{"name_latin": "Psathyrella candolleana", "name_eng": "Common Park Psathyrella", "url": "http://www.mushroom.world/show?n=Psathyrella-candolleana", "img_urls": ["http://www.mushroom.world/data/fungi/Psathyrellacandolleana1.JPG", "http://www.mushroom.world/data/fungi/Psathyrellacandolleana2.JPG", "http://www.mushroom.world/data/fungi/Psathyrellacandolleana3.JPG", "http://www.mushroom.world/data/fungi/Psathyrellacandolleana4.JPG", "http://www.mushroom.world/data/fungi/Psathyrellacandolleana5.JPG"], "description": "Cap 2-6 cm diameter, stem 4-8 cm tall * 0.4-0.8 cm thick. Psathyrella candolleana, also known as Common Park Psathyrella,  is a smallish agaric that has a cap whose color varies between white and golden brown and the margin is irregular and radially asymmetrical, which is a defining characteristic of this species. It grows typically tufted on soil close to broad-leaf trees, also on stumps and other woody debris.\n\nCap convex to umbonate, yellow-brown in colour, as dry ivory white. The margin is thin and has veil remains as young. The flesh is white and thin. Gills at first pallid gray with lilaceous tinge, gray- to chocolate-brown as mature, adnate or adnexed, crowded. Spores are dark brown. Stem white, fragile, hollow and smooth. It has no ring.\n\nSimilar species The much darker Psathyrella spadiceogrisea occurs along forest paths and in similar sites in late spring and early summer.\n\nPsathyrella candolleana on the First Nature Web site.\n", "edibility": "inedible"},
{"name_latin": "Polyporus squamosus", "name_eng": "Dryad’s Saddle", "url": "http://www.mushroom.world/show?n=Polyporus-squamosus", "img_urls": ["http://www.mushroom.world/data/fungi/Polyporussquamosus1.JPG", "http://www.mushroom.world/data/fungi/Polyporussquamosus2.JPG", "http://www.mushroom.world/data/fungi/Polyporussquamosus3.jpg"], "description": "Cap 10-60 cm diameter, 0.5-5 cm thick. Polyporus squamosus, also known as Cerioporus squamosus or Dryad’s Saddle, has a circular to fan-shaped bracket, covered with brown scales, a black stem positioned to one side, and a decurrent off-white to ocher tube layer. It grows annually, alone or in clusters of two or three, on broad-leaf trees, also on stumps, favouring beech, elm and sycamore.\n\nFruiting body can be yellow to brown and has \"squamules\" or scales on its upper side. On the underside it has whitish cream pores that are made up of tubes packed together closely. The tubes are between 5 and 10 mm long. The taste is not distinctive. Stem black, thick and short.\n\nPolyporus squamosus on the Nature First Web site.", "edibility": "edible "},
{"name_latin": "Polyporus ciliatus", "name_eng": "Fringed Polypore", "url": "http://www.mushroom.world/show?n=Polyporus-ciliatus", "img_urls": ["http://www.mushroom.world/data/fungi/Polyporusciliatus1.JPG", "http://www.mushroom.world/data/fungi/Polyporusciliatus2.JPG", "http://www.mushroom.world/data/fungi/Polyporusciliatus3.JPG", "http://www.mushroom.world/data/fungi/Polyporusciliatus4.JPG", "http://www.mushroom.world/data/fungi/Polyporusciliatus5.JPG"], "description": "Cap 2-12 cm diameter, stem 2-4 cm tall * 0.2-0.7 cm thick. Polyporus ciliatus, also known as Fringed Polypore, is a polypore that grows on fallen branches of deciduous trees annually on spring and early summer. \n\nFruiting body upper surface grayish brown or yellowish-brown, convex at first, flattening with a depressed (umbilicate) centre. Particularly towards the margin, the cap surface is usually covered in tiny bristly hairs. The flesh is white and leathery. Stem variable in colour, often pale yellowish brown or tawny-buff, more or less equal, typically curved and sometimes thickened at the base. Pores whitish cream to buff, circular, elongating with age.\n", "edibility": "inedible"},
{"name_latin": "Pholiota squarrosa", "name_eng": "Dry Scaly Pholiota", "url": "http://www.mushroom.world/show?n=Pholiota-squarrosa", "img_urls": ["http://www.mushroom.world/data/fungi/Pholiotasquarrosa1.JPG", "http://www.mushroom.world/data/fungi/Pholiotasquarrosa2.JPG", "http://www.mushroom.world/data/fungi/Pholiotasquarrosa3.JPG", "http://www.mushroom.world/data/fungi/Pholiotasquarrosa4.JPG", "http://www.mushroom.world/data/fungi/Pholiotasquarrosa5.JPG"], "description": "Cap 3-12 cm diameter, stem 5-12 cm tall * 1-1.5 cm thick. Pholiota squarrosa, also known as Dry Scaly Pholiota, has a hat that is yellow-white and covered with brown scales. The gills are light yellow to brown. The foot is the same color as the hat and protruding scales. Grows on hardwood, often at the base of live or dead hardwoods.\n\nCap first bell-shaped to rounded and later somewhat flattened, yellowish-brown to tawny in older specimens. The scales on the cap are yellowish to tawny, and recurved. Flesh pallid yellow and firm. Gills are covered by a partial veil when young and have a greenish-brown color; mature gills are rusty brown and crowded closely together, attached to the stem (adnate), and usually notched (sinuate). Spores are brown. Stem colored as cap above, becoming tinged rust towards the base, more or less equal or tapering downwards, scaly as cap. The ring is ragged and almost zone-like.\n\nSimilar species Smaller and paler Pholiota squarrosoides is highly sticky-slimy beneath the scales. It also occurs on deciduous trees but is rare in Europe, more common in North America. Gymnopilys junonius found in the same habitat, lacks the distinctive cap scales.\n\nPholiota squarrosa on the Nature First Web site.", "edibility": "inedible"},
{"name_latin": "Pholiota aurivella", "name_eng": "Golden Scalycap", "url": "http://www.mushroom.world/show?n=Pholiota-aurivella", "img_urls": ["http://www.mushroom.world/data/fungi/Pholiotaaurivella1.jpg", "http://www.mushroom.world/data/fungi/Pholiotaaurivella2.jpg", "http://www.mushroom.world/data/fungi/Pholiotaaurivella3.jpg", "http://www.mushroom.world/data/fungi/Pholiotaaurivella4.jpg", "http://www.mushroom.world/data/fungi/Pholiotaaurivella5.jpg"], "description": "Cap 4-15 cm diameter, stem 5-18 cm tall * 0.5-1.5 cm thick. Pholiota aurivella, also known as Golden Scalycap, is a medium to large, orange-yellow, rounded agaric with scattered, reddish orange scales embedded in the surface.\n\nCap Bright yellow, convex to broadly humped. Surface scales embedded in a slime layer, sometimes disappearing in rain. Gills close, adnate (broadly attached) at first; yellowish to reddish brown. Spores are reddish-brown. Stem central or off center, cylindrical, solid, firm. Surface cottony above poorly developed ring, fibrillose to scaly below.\n\nSimilar species Pholiota jahnii and Pholiota limonella.", "edibility": "inedible"},
{"name_latin": "Pholiota alnicola", "name_eng": "Alder Scalycap", "url": "http://www.mushroom.world/show?n=Pholiota-alnicola", "img_urls": ["http://www.mushroom.world/data/fungi/Pholiotaalnicola1.JPG", "http://www.mushroom.world/data/fungi/Pholiotaalnicola2.JPG", "http://www.mushroom.world/data/fungi/Pholiotaalnicola3.JPG", "http://www.mushroom.world/data/fungi/Pholiotaalnicola4.JPG", "http://www.mushroom.world/data/fungi/Pholiotaalnicola5.JPG", "http://www.mushroom.world/data/fungi/Pholiotaalnicola6.JPG"], "description": "Cap 2-8 cm diameter, stem 2-8 cm tall * 0.5-1 cm diameter. Pholiota alnicola, also know as Alder Scalycap, has a yellow, or yellow with some green intermixed hat, lemon-yellow gills (becoming cinnamon), and a ring zone on stem. It grows solitary or more typically clustered on dead or dying decidous trees, such as alder or birch often in damp sites.\n\nCap is bright yellow or yellow with some green intermixed, often with rusty brown spots. Gills are adnate to slightly decurrent, straw-yellow to rust brown. Spores are brown. Stem yellow toward top and rusty brown toward base. Ring is zone-like with pallid remnants of veil, very superior.\n\nSimilar species Three forms of Pholiota alnicoloa are sometimes classified separately. Pholiota salicola grows on willow, and it tastes bitter; Pholiota flavida and Pholiota pinicola grow on conifers.\n\nPholiota alnicola on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Phallus rubicundus", "name_eng": "", "url": "http://www.mushroom.world/show?n=Phallus-rubicundus", "img_urls": ["http://www.mushroom.world/data/fungi/Phallusrubicundus1.jpg", "http://www.mushroom.world/data/fungi/Phallusrubicundus2.jpg"], "description": "Cap 1-2 cm diameter; stem 3-12 cm tall x 0.5-3 cm diameter. Phallus rubicundus is a species in the stinkhorn family and has a wide distribution in tropical regions. It has the typical stinkhorn structure consisting of a spongy stalk up to 15 cm tall arising from a gelatinous \"egg\" up to 3 cm in diameter.\n\nFruiting body consist of a hollow cylindrical stalk supporting a conical to bell-shaped cap. The orange to scarlet stalk tapers towards to top, and has a pitted surface. The wrinled cap is scarlet red. It is initially covered with a foetid, slimy grayish-olive gleba.\n\nSimilar species Mutinus elegans does not have a clearly separated cap, and instead bears its gleba on the apex of its pointed stalk.\n", "edibility": "inedible"},
{"name_latin": "Paxillus involutus", "name_eng": "Poison Pax", "url": "http://www.mushroom.world/show?n=Paxillus-involutus", "img_urls": ["http://www.mushroom.world/data/fungi/Paxillusinvolutus1.JPG", "http://www.mushroom.world/data/fungi/Paxillusinvolutus2.JPG", "http://www.mushroom.world/data/fungi/Paxillusinvolutus3.JPG", "http://www.mushroom.world/data/fungi/Paxillusinvolutus4.JPG", "http://www.mushroom.world/data/fungi/Paxillusinvolutus5.JPG"], "description": "Cap 5-12 cm diameter, stem 3-7 cm tall * 0.8-1.2 cm diameter. Paxillus involutus, also know as Poison Pax, has a strongly inrolled, yellow- to red-brown cap, with a downy margin and slightly depressed center and ochre-brown gills. It grows solitary or in trooping groups on soil in leaf woods.\n\nCap initially convex then more funnel-shaped with a depressed centre and rolled rim, may be reddish-, yellowish- or olive-brown in colour. The surface is initially downy and later smooth, becoming sticky when wet. Gills brownish yellow, narrow, decurrent and forked, and can be peeled easily from the flesh. They further down toward the stem become more irregular and anastomose. Stem is similarly colored as the cap, however bruising darker brown. It is smooth, equal or tapering downwards. The mushroom has not ring.\n\nSimilar species Paxillus filamentous has a less incurved margin, yellow flesh, and occurs under alder.\n\nPaxillus involutus on the First Nature Web site.\n", "edibility": "poisonous"},
{"name_latin": "Paxillus atrotomentosus", "name_eng": "Velvet Rollrim", "url": "http://www.mushroom.world/show?n=Paxillus-atrotomentosus", "img_urls": ["http://www.mushroom.world/data/fungi/Paxillusatrotomentosus1.JPG", "http://www.mushroom.world/data/fungi/Paxillusatrotomentosus2.JPG", "http://www.mushroom.world/data/fungi/Paxillusatrotomentosus3.JPG", "http://www.mushroom.world/data/fungi/Paxillusatrotomentosus4.JPG", "http://www.mushroom.world/data/fungi/Paxillusatrotomentosus5.JPG"], "description": "Cap 12-28 cm diameter, stem 3-9 cm tall * 2-5 cm thick. Paxillus atrotomentosus, also know as Tapinella atrotomentosa or Velvet Rollrim is a large or massive agaric that has a brown cap, buff gills and a dark brown, velvety, sometimes eccentric stem. Grows in woods and three stands, on and around conifer stumps and sometimes buried, coniferous wood.\n\nCap sepia- or walnut brown in colour with a inrolled cap margin and depressed centre. The cap is covered with dark brown or black velvety fur. Gills cream-yellow and forked, becoming ochre and spotted rust with age.\nSpores are sienna-brown. Stem thick, dark brown and juts out sidewards from the mushroom. The mushroom has no ring.\n\nSynonymes Tapinella atrotomentosa is the newer name.\n\nTapinella atrotomentosa on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Otidea onotica", "name_eng": "Lemon-Peel Cup", "url": "http://www.mushroom.world/show?n=Otidea-onotica", "img_urls": ["http://www.mushroom.world/data/fungi/Otideaonotica1.jpg", "http://www.mushroom.world/data/fungi/Otideaonotica2.jpg"], "description": "4-6 cm diameter * 4-10 cm tall. Otidea onotica, also known as Lemon-Peel Cup, is a pinkish yellow, irregular cup formed fungus that grows solitary and in small trooping groups on soil in broad-leaf and mixed woods from spring to early autumn. It tends to grow under beech trees.\n\nFruiting body lemon-yellow to yellow or rosy orange. The ear-shaped cup is split down one side and has a stemlike, off-white base and wavy margin. The thin, pale flesh may develop rusty spots with age.\n\nSimilar species Otidea leporina is found mostly in conifer forests. The dark brown Otidea smithii is common in the Rocky Mountains. Wynnea americana, which grows from a sclerotial mass, is also dark brown but with a reddish inner surface.\n\nOtidea onotica on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Mycena pura", "name_eng": "Poison Radish Ground Mycena", "url": "http://www.mushroom.world/show?n=Mycena-pura", "img_urls": ["http://www.mushroom.world/data/fungi/Mycenapura1.JPG", "http://www.mushroom.world/data/fungi/Mycenapura2.JPG", "http://www.mushroom.world/data/fungi/Mycenapura3.JPG", "http://www.mushroom.world/data/fungi/Mycenapura4.JPG"], "description": "Cap 2-6 cm diameter, stem 3-9 cm tall * 0.3-1 cm thick. Mycena pura, also know as the Poison Radish Ground Mycena, is a small or medium, variable agaric comes in many different colours, usually with purple tints. Some are considered separate species or varieties; all smell of radishes. It grows typically in wooded and open habitats on humus-rich soil.\n\nCap convex or bell-shaped, becoming flattened; the margin lined; bald; moist or dry; typically lilac to purple when young, but often fading or developing other shades. Gills adnexed to adnate, may be sinuate and notched; whitish or sometimes slightly pinkish to purplish; developing cross-veins with maturity. Spores the spore print is white. Stem  equal; hollow; smooth or with tiny hairs; usually similar coloured as the cap or paler. The mushroom has no ring.\n\nMycena pura on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Mycena galericulata", "name_eng": "Common Tufted Mycena", "url": "http://www.mushroom.world/show?n=Mycena-galericulata", "img_urls": ["http://www.mushroom.world/data/fungi/Mycenagalericulata1.JPG", "http://www.mushroom.world/data/fungi/Mycenagalericulata2.JPG", "http://www.mushroom.world/data/fungi/Mycenagalericulata3.JPG", "http://www.mushroom.world/data/fungi/Mycenagalericulata4.JPG"], "description": "Cap 2-8 cm diameter, stem 5-10 cm tall * 0.2-0.4 cm thick. Mycena galericulata, also known as Common Tufted Mycena is a small or medium, grayish brown agaric that has a bell-shaped, radially grooved cap and pinkish gills.It grows in woods on the trunks, stumps and fallen branches of various types of decidous trees.\n\nCap roughly conical when young, becomes broadly bell-shaped or with a broad umbo. Margin initially somewhat curved inward, but soon evens out or even becomes uplifted, and often splits radially in age. Color is somewhat buff-brown on the margin, and fades gradually to pale dirty tan to dirty cinnamon-brown. Flesh is thick in the center of the cap and tapers evenly to the margin, and is watery gray. Gills narrowly attached (adnexed) to broadly attached or sinuate. The gill spacing ranges from close to somewhat distantly spaced, with 26–36 gills reaching the stem. Spores are pale cream colored. Stem is similarly colored as the cap but more pallid near the apex. It is smooth, slender, more or less equal, and somewhat rooting.  It has white hair. The mushroom has no ring.\n\nMycena galericulata on the Firs Nature Web site.", "edibility": "inedible"},
{"name_latin": "Morchella elata", "name_eng": "Black Morel", "url": "http://www.mushroom.world/show?n=Morchella-elata", "img_urls": ["http://www.mushroom.world/data/fungi/Morchellaelata1.JPG", "http://www.mushroom.world/data/fungi/Morchellaelata2.JPG", "http://www.mushroom.world/data/fungi/Morchellaelata3.JPG", "http://www.mushroom.world/data/fungi/Morchellaelata4.jpg", "http://www.mushroom.world/data/fungi/Morchellaelata5.jpg"], "description": "2-4 cm diameter * 5-15 cm tall. Morchella elata, also know as Black Morel, is like most members of the genus a popular edible fungus and is sought by many mushroom hunters. It has a conical cap with distinct black ridges and brown to smoky-grey pits. The stem is white with a rough, mealy or granular surface and hollow center.\n\nFruiting body is yellowish brown, with darker parallel longitudinal ribs that are connected to form honeycomb-like pits; while conical, it tapers downward into a creamy-white stem, more or less equal. Flesh is white, brittle, thin and hollow.\n\nSimilar species Morchella esculenta is yellow with pale ribs along the length of its cap. Gyromitra species, which are poisonous, lack the pitted cap. It has a chambered, rather than hollow, stem.", "edibility": "edible "},
{"name_latin": "Melanoleuca cognata", "name_eng": "Spring Cavalier", "url": "http://www.mushroom.world/show?n=Melanoleuca-cognata", "img_urls": ["http://www.mushroom.world/data/fungi/Melanoleucacognata1.JPG", "http://www.mushroom.world/data/fungi/Melanoleucacognata2.JPG", "http://www.mushroom.world/data/fungi/Melanoleucacognata3.JPG", "http://www.mushroom.world/data/fungi/Melanoleucacognata4.JPG"], "description": "Cap 4-10 cm diameter, stem 5-12 cm tall * 1-1.5 cm thick. Melanoleuca cognata, also know as Spring Cavalier, is a medium or large agaric, that is pale brown with an umbonate cap and white gills. It occurs often in the spring, when few other gilled mushrooms are fruiting, and grows solitary or scattered on soil in coniferous woods.\n\nCap buff to warm brown, umbonate. Flesh cream, soft and full. Gills crowded, sinuate, notched and pink to dark ocher colored. Spores cream colored. Stem rust colored with brownish fibrils, tapering slightly upwards from more or less bulbous base. The mushroom has not ring. \n\nMelanoleuca cognata on the First NatureWeb site.", "edibility": "edible "},
{"name_latin": "Megacollybia platyphylla", "name_eng": "Broad-gilled Collybia", "url": "http://www.mushroom.world/show?n=Megacollybia-platyphylla", "img_urls": ["http://www.mushroom.world/data/fungi/Megacollybiaplatyphylla1.JPG", "http://www.mushroom.world/data/fungi/Megacollybiaplatyphylla2.JPG", "http://www.mushroom.world/data/fungi/Megacollybiaplatyphylla3.JPG"], "description": "Cap 4-12 cm diameter, stem 6-15 cm tall * 1.5-2 cm thick. Megacollybia platyphylla, also know as Broad-gilled Collybia, is a medium to large, fleshy agaric that has a pale brown, fibrillose cap, whitish gills and stem. It grows on buried decidous branches and stumps.\n\nCap mid- to pale brown, convex to umbonate. It has radiating fibers on dry cap surface. Gills medium-spaced, adnate or notched.  Spores are pale cream colored. Stem hollow at center and whitish, with darker fine fibrils that are less dense than on cap. It is more or less equal and thickened at base. It has no ring.\n\nSimilar species Pluteus cervinus has free gills and a salmon-pink spore print.", "edibility": "inedible"},
{"name_latin": "Marasmius oreades", "name_eng": "Fairy Ring Marasmius", "url": "http://www.mushroom.world/show?n=Marasmius-oreades", "img_urls": ["http://www.mushroom.world/data/fungi/Marasmiusoreades1.JPG", "http://www.mushroom.world/data/fungi/Marasmiusoreades2.JPG", "http://www.mushroom.world/data/fungi/Marasmiusoreades3.JPG", "http://www.mushroom.world/data/fungi/Marasmiusoreades4.JPG", "http://www.mushroom.world/data/fungi/Marasmiusoreades5.JPG"], "description": "Cap 2-5 cm diameter, stem 2-10 cm tall * 0.3-0.5 cm thick. Marasmius oreades, also known as Fairy Ring Marasmius, is a small agaric which is producing characteristic rings in turf. It has a bell-shaped to convex cap, which becomes flatter with a broad umbo with age.\n\nCap at first convex, then flat to cup shaped with a low central hump that is often a darker shade. Color varies from light beige to brown yellow. The margins are usually crinkled and almost transparent and streaky in damp weather. They turn lighter in dry weather, and regain their color in more humid conditions. The flesh is whitish buff, thick at the center, otherwise thin. Gills free, sparse, and convex in the center with horizontal ridges. Creamy white at fist, becoming ochraceous-cream, fairly broad and distant. Spores off-white. Stem tall, colored as cap, smooth or finely scurfy, slender, more or less equal, whitish downy at the base and slightly rooting, stiff. The mushroom has no ring.\n\nSimilar species The poisonous Clitocybe dealbata is found in the same grassy habitat. It is distinguished by its decurrent gills. Can also be mixed up with the very poisonous mushrooms Clitocybe rivulosa and Clitocybe dealbata.\n\nMarasmius oreades on the First Nature Web site.", "edibility": "edible and good "},
{"name_latin": "Macrolepiota procera", "name_eng": "Parasol Mushroom", "url": "http://www.mushroom.world/show?n=Macrolepiota-procera", "img_urls": ["http://www.mushroom.world/data/fungi/Macrolepiotaprocera1.jpg", "http://www.mushroom.world/data/fungi/Macrolepiotaprocera2.JPG", "http://www.mushroom.world/data/fungi/Macrolepiotaprocera3.jpg", "http://www.mushroom.world/data/fungi/Macrolepiotaprocera4.jpg", "http://www.mushroom.world/data/fungi/Macrolepiotaprocera5.jpg"], "description": "Cap 10-25 cm diameter; stem 15-30 cm tall * 1-1.5 cm diameter. Macrolepiota procera, also known as the Parasol Mushroom, is a spectacularly large, distinctive, pale brownish agaric that has a scaly cap, white gills, and a pale brownish stem with a snakeskin pattern and ring. It grows solitary, scattered or clustered on soil in open grassy places and in mixed woods.\n\nCap pallid brown decorated with darker brown broad scales, starts off egg shaped and then bell shaped until the cap margin detaches from the stripe. The base colour becomes lighter with age. Dark scales appear on top when the brown surface cracks up from the smooth, central bump. Gills are white, free, and crowded. Flesh creamy white and soft. Stem is distinctive grey-brown with banded markings on a whitish background, long and thin with an onion shaped base. Above the dubble-edged ring that often falls off, it is evenly brown and below this, it is irregularly striped in a zigzag pattern. Ring is white above and brown below.\n\nSimilar species The poisonous Chlorophyllum molybdites has a stouter stalk and a green spore print. \n\nMacrolepiota procera on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Macrolepiota  rachodes", "name_eng": "Shaggy Parasol Lepiota", "url": "http://www.mushroom.world/show?n=Macrolepiota--rachodes", "img_urls": ["http://www.mushroom.world/data/fungi/Macrolepiotarachodes1.JPG", "http://www.mushroom.world/data/fungi/Macrolepiotarachodes2.JPG", "http://www.mushroom.world/data/fungi/Macrolepiotarachodes3.JPG", "http://www.mushroom.world/data/fungi/Macrolepiotarachodes4.JPG"], "description": "Cap 5-15 cm diameter; stem 10-15 cm tall * 1-1.5 cm diameter. Macrolepiota  rachodes, also know as Shaggy Parasol Lepiota, is a large, fleshy agaric with shaggy, pale grey-brown cap and whitish gem with ring and bulbous base. It grows solitary or scattered on in woods generally, often with conifers.\n\n[Description is under work.]\n\nChlorophyllum rhacodes on the Firs Nature Web site.\n\nChlorophyllum rhacodes on the MushroomExpert.Com Web site.", "edibility": "poisonous"},
{"name_latin": "Lycoperdon pyriforme", "name_eng": "Stump Puffball", "url": "http://www.mushroom.world/show?n=Lycoperdon-pyriforme", "img_urls": ["http://www.mushroom.world/data/fungi/Lycoperdonpyriforme1.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonpyriforme2.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonpyriforme3.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonpyriforme4.JPG"], "description": "1.5-4 cm diameter, 1-5 cm tall. Lycoperdon pyriforme, also known as Stump Puffball, is identified by its elongated pear shape, its smooth surface at maturity, white cords at the base, and its occurrence on woody substrates (other in genus grows on the ground).\n\nFruiting body often pear-shaped, but may also be nearly spherical. When very young covered in small white spines that typically fall off before maturity. Colour ranges from nearly white to yellowish brown with the darker shades developing with age. Spore mass at first white and firm, becoming olive-brown and powdery. Spores are olive-brown.\n\nSimilar species Found in open, wooded areas, Lycoperdon lividium is also smooth, but is grayer and has warty spores (those of Lycoperdon pyriforme are almost smooth).\n\nLycoperdon pyriforme on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Lycoperdon perlatum", "name_eng": "Common Puffball", "url": "http://www.mushroom.world/show?n=Lycoperdon-perlatum", "img_urls": ["http://www.mushroom.world/data/fungi/Lycoperdonperlatum1.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonperlatum2.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonperlatum3.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonperlatum4.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonperlatum5.JPG"], "description": "2.5-6 cm diameter * 2-9 cm tall. Lycoperdon perlatum, also known as Common Puffball, is a yellowish brown rounded fungus, typically with a distinct stem and covered with short spines, each surrounded by smaller, grainlike scales. It grows typically in troops on soil in mixed woodland.\n\nFruiting body white, becoming ochre-brown, covered with short pyramidial warts which fall off to reveal endoperidium decorated with a reticulate patter; sub-spherical opening by an apical pore, the fertile head tapering down into a distinct, sterile, basal region. Spore mass at first white and firm, becoming olive-brown and powdery. Spores are pale yellow to olive-brown. \n\nSimilar species Lycoperdon nigrescens has longer, darker spines in groups, like those of the much longer-spined Lycoperdon echinatum. The surface of both has a similar pattern when the spines fall off.\n\nLycoperdon perlatum on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Lycoperdon nigrescens", "name_eng": "Dusky Puffball", "url": "http://www.mushroom.world/show?n=Lycoperdon-nigrescens", "img_urls": ["http://www.mushroom.world/data/fungi/Lycoperdonnigrescens1.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonnigrescens2.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonnigrescens3.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonnigrescens4.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonnigrescens5.JPG"], "description": "1-4 cm diameter * 1.5-3 cm tall. Lycoperdon nigrescens, also known as Dusky Puffball, is a rounded fungus, typically with a distinct stem and long dark spines. It typically grows in troops on acid soil on heaths and in coniferous and mixed woods.\n\nFruiting body is pallid brown covered with dark brown spines. They are fused in groups at the tips, falling away to reveal a brown papery surface decorated with a faint net pattern. Through a sub-spherical opening through a pore at the apex, the fertile head tapers or pinches down into a distinct, but very short, sterile, spongy basal region. Spore mass is at first white and firm becoming brown and powdery.  Spores are brown.", "edibility": "inedible"},
{"name_latin": "Lycoperdon excipuliforme", "name_eng": "Pistle-shaped Puffball", "url": "http://www.mushroom.world/show?n=Lycoperdon-excipuliforme", "img_urls": ["http://www.mushroom.world/data/fungi/Lycoperdonexcipuliforme1.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonexcipuliforme2.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonexcipuliforme3.JPG", "http://www.mushroom.world/data/fungi/Lycoperdonexcipuliforme4.JPG"], "description": "3-10 cm diameter * 8-20 cm tall. Lycoperdon excipuliforme, also know as Pistle-shaped Puffball, is a  pale buff or brown, pestle-shaped fungus that fruits most often singly or in very small groups in woodland habitats.\n\nFruiting body Covered with short spines and warts, the body falls away pallid buff becoming dull brown. When mature, the outer skin breaks open and brown spores are dispersed by wind and rain. When young and firm, the fruit-bodies are fairly tasteless yet edible. Stem slightly tapering in at the base; spongy; surface soon becoming wrinkled; initially white with pointed warts, but later turning ochre and becoming smooth and leathery.\n\nSimilar species Calvatia elata is widespread and common in North America. Lycoperdon molle resembles a short-stemmed specimen.\n\nSynonyms Handkea excipuliformis", "edibility": "edible "},
{"name_latin": "Lepista nuda", "name_eng": "Wood Blewit", "url": "http://www.mushroom.world/show?n=Lepista-nuda", "img_urls": ["http://www.mushroom.world/data/fungi/Lepistanuda1.JPG", "http://www.mushroom.world/data/fungi/Lepistanuda2.JPG", "http://www.mushroom.world/data/fungi/Lepistanuda3.JPG", "http://www.mushroom.world/data/fungi/Lepistanuda4.JPG", "http://www.mushroom.world/data/fungi/Lepistanuda5.JPG"], "description": "Cap 6-12 cm diameter, stem 5-9 cm tall * 1.5-2.5 cm thick. Lepista nuda, also know as Clitocybe nuda or Wood Blewit, is a medium-sized, fleshy agaric, with a brownish cap and lilac gills. It grows in trooping groups, often in rings, in leaf litter in deciduous and mixed woodland and under hedgerows during autumn and winter.\n\nCap violet-brown, emerges dark and bun-shaped, becoming convex and then flattened. It's colour becomes paler from the marigin as the cap surface dries. The flesh bluish lilac, thick, firm. Gills lilaceous, attached to the short, stout stem. Spores are pink. Stem colored as cap, more or less equal, fibrillose and often slightly thickened at the base. The mushroom has no ring.\n\nSimilar species Unrelated poisonous look-alikes include species of Entoloma, Cortinarius and Hebeloma. Cortinarius mushrooms often have the remains of a veil under their caps and a ring-like impression on their stem.\n\nClitocybe nuda on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Leccinum versipelle", "name_eng": "Orange Birch Bolete", "url": "http://www.mushroom.world/show?n=Leccinum-versipelle", "img_urls": ["http://www.mushroom.world/data/fungi/Leccinumversipelle1.JPG", "http://www.mushroom.world/data/fungi/Leccinumversipelle2.JPG", "http://www.mushroom.world/data/fungi/Leccinumversipelle3.JPG", "http://www.mushroom.world/data/fungi/Leccinumversipelle4.JPG", "http://www.mushroom.world/data/fungi/Leccinumversipelle5.JPG"], "description": "Cap 8-20 cm diameter, stem 8-20 cm tall * 1.5-4 cm thick. Leccinum versipelle, also known as Orange Birch Bolete, is a large or massive bolete, that can weigh up to 1.5 kg and has a distinctive orange cap, grayish yellow pores and a scaly stem. It grows solitary or in small scattered groups on soil specifically under birch trees and on heaths.\n\nCap clear orange or red brown. Round to start with, then oval and finally convex. Grainy or smooth as dry, and sticky when damp. The orange cap skin hangs down over the margin. Pores are circular and small. They are at first whitish, then buff, darkening rust where bruised. Tubes are similarly colored as the pores, wine colored where cut, and depressed. Spores are ocher-brown. Stem black tufts on a gray-white base that get sparser with age and often thicker at the base. The mushroom has no ring.\n", "edibility": "edible "},
{"name_latin": "Leccinum scabrum", "name_eng": "Brown Birch Bolete", "url": "http://www.mushroom.world/show?n=Leccinum-scabrum", "img_urls": ["http://www.mushroom.world/data/fungi/Leccinumscabrum1.JPG", "http://www.mushroom.world/data/fungi/Leccinumscabrum2.JPG", "http://www.mushroom.world/data/fungi/Leccinumscabrum3.JPG", "http://www.mushroom.world/data/fungi/Leccinumscabrum4.JPG", "http://www.mushroom.world/data/fungi/Leccinumscabrum5.JPG", "http://www.mushroom.world/data/fungi/Leccinumscabrum6.JPG"], "description": "Cap 5-15 cm diameter, stem 6-15 cm tall * 1.5-3 cm diameter. Leccinum scabrum, also know as Brown Birch Bolete, is a medium to large bolete that has a brown cap with gray-white pores and a white to gray stem covered with with gray-black scales. It grows specifically with birch, often on damp gound.\n\nCap brown, with reddish or grayish tinges; convex or bun-shaped, at first finely downy, becoming smooth, somewhat scurfy when older. Flesh dirty white, unchanging, thick and firm. Pores dirty white or grayish brown, circular, small. Tubes same color as pores, adnate. Spores are ocher-brown. Stem whitish, covered with gray-brown scales, more or less equal or tapering slightly upwards. Ring absent. \n\nSimilar species Distinguishing between Leccinum scabrum and its near relatives is difficult, and Leccinum scabrum is often used as a collective name for all brown capped Leccinum species like Leccinum variicolor.\n", "edibility": "edible "},
{"name_latin": "Leccinum aurantiacum", "name_eng": "Orange Oak Bolete", "url": "http://www.mushroom.world/show?n=Leccinum-aurantiacum", "img_urls": ["http://www.mushroom.world/data/fungi/Leccinumaurantiacum1.JPG", "http://www.mushroom.world/data/fungi/Leccinumaurantiacum2.JPG", "http://www.mushroom.world/data/fungi/Leccinumaurantiacum3.JPG", "http://www.mushroom.world/data/fungi/Leccinumaurantiacum4.JPG"], "description": "Cap 5-10 cm diameter, stem 8-14 cm tall * 1.5-4.5 cm thick. Leccinum aurantiacum, also known as Orange Oak Bolete, is a large or massive bolete that has a bun shaped orange cap, whitish pores and a scaly stem, which is darkening throughout where cut or bruised. It grows solitary or in small scattered groups on soil specifically under aspen.\n\nCap bright orange skin, at first round like a ball, then ovate or bun-shaped. It is sticky when damp and has, just like Leccinum versipelle, a larger skin that hangs down or is tucked under the margin of the cap. Flesh creamy-white then vinaceous or sepia where cut. Thick and firm. Pores white or cream, darkening vinaceous where bruised, circular. very small. Spores are ochraceous-buff. Stem dirty white, covered with woolly scales in irregular network, at first white then rust, stoutish, more or less equal or swollen towards base. The mushroom has no ring.\n\nSimilar species The most similar species is Leccinum versipelle, which differing from Leccinum aurantiacum grows under birch trees.\n", "edibility": "edible "},
{"name_latin": "Laetiporus sulphureus", "name_eng": "Chicken of the Woods", "url": "http://www.mushroom.world/show?n=Laetiporus-sulphureus", "img_urls": ["http://www.mushroom.world/data/fungi/Laetiporussulphureus1.jpg", "http://www.mushroom.world/data/fungi/Laetiporussulphureus2.jpg", "http://www.mushroom.world/data/fungi/Laetiporussulphureus3.JPG", "http://www.mushroom.world/data/fungi/Laetiporussulphureus4.JPG"], "description": "Cap 5 to 60 cm in diameter and 4 cm thick. The fruit bodies of this mushroom grow as striking golden-yellow shelf-like structures on tree trunks and branches. The undersurface of the fruit body is made up of tubelike pores rather than gills.\n\nFruiting body attached directly to the trunk of a tree and is initially knob-shaped, later expands to fan-shaped, typically overlapping shelves with thick margin. The upper surface color ranges from bright whitish-yellow to bright whitish-orange. Flesh soft and coloured as cap surface. Old fruitbodies fade to tan or whitish. The under surface is sulphur-yellow with small pores or tubes and has a white spore print. When fresh, the flesh is succulent and exudes a yellowish juice, but soon becomes dry and brittle. It has a strong, fungusy smell.\n\nLaetiporus sulphureus on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Lactarius volemus", "name_eng": "Luscious Lactarius", "url": "http://www.mushroom.world/show?n=Lactarius-volemus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariusvolemus1.JPG", "http://www.mushroom.world/data/fungi/Lactariusvolemus2.jpg", "http://www.mushroom.world/data/fungi/Lactariusvolemus3.jpg"], "description": "Cap 5-11 cm diameter, stem 4-12 cm tall * 1-3 cm diameter. Lactarius volemus, also know as Luscious Lactarius, is a very fleshy, matte orange agaric that has a thin, cracking skin on its cap and a thick, velvety pale orange stem. When cut, it's off-white, mild-tasting flesh produces white milk.\n \nCap dry and velvety with a powdery matte texture and never sticky. Matte orange to red-brown coloured. At first slightly convex and develops a depression in the center later. The margin stays inrolled for some time. Gills creamy white, broadly attached to the stem slightly extending downward and densely packed. Turns brown when bruised. White drops often hangs under the gills. Stem is similarly colored as the cap but more pallid. Tapers off and darkens towards the base. It has no ring.\n\nSimilar species Lactarius hygrophoroides is a good edible lacking the odor. It is equally common in eastern North America. It does not stain and has distant gills.", "edibility": "edible and good "},
{"name_latin": "Lactarius turpis", "name_eng": "Ugly Milkcap", "url": "http://www.mushroom.world/show?n=Lactarius-turpis", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariusturpis1.JPG", "http://www.mushroom.world/data/fungi/Lactariusturpis2.JPG", "http://www.mushroom.world/data/fungi/Lactariusturpis3.JPG", "http://www.mushroom.world/data/fungi/Lactariusturpis4.JPG", "http://www.mushroom.world/data/fungi/Lactariusturpis5.JPG", "http://www.mushroom.world/data/fungi/Lactariusturpis6.JPG"], "description": "Cap 5-15 cm diameter, stem 4-8 cm tall * 1-2.5 cm thick. Lactarius turpis, also know as Ugly Milkcap, is a large, dull olive-brown agaric which is typically slimy or sticky and exudes white milk. The appearance is distinctive and the English name is very appropriate. It grows solitary or in scattered groups on soil in damp places under birch.\n\nCap margin at first involute with a somewhat depressed centre. The upper surface is olive brown or yellow-green and is often sticky or slimy in the middle. When young it has velvety zones and may be shaggy at the rim. Later it becomes funnel-shaped and the colour darkens to blackish. Gills dirty white, stained olive-brown by old milk. Initially white. They are fairly narrow, crowed and extending downward. Stem similar in colour as the cap, but much lighter.", "edibility": "inedible"},
{"name_latin": "Lactarius trivialis", "name_eng": "Slimy Lead Lactarius", "url": "http://www.mushroom.world/show?n=Lactarius-trivialis", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariustrivialis1.JPG", "http://www.mushroom.world/data/fungi/Lactariustrivialis2.JPG", "http://www.mushroom.world/data/fungi/Lactariustrivialis3.JPG", "http://www.mushroom.world/data/fungi/Lactariustrivialis4.JPG", "http://www.mushroom.world/data/fungi/Lactariustrivialis5.JPG", "http://www.mushroom.world/data/fungi/Lactariustrivialis6.JPG"], "description": "Cap 6-15 cm diameter, stem 6-12 cm tall * 1-2 cm thick. Lactarius trivialis, also known as the Slimy Lead Lactarius, is an agaric that has a large fleshy cap that is often spotted or fainty concentrically zoned and pale gills and stem. It exudes white milk and grows solitary or in scattered groups on boggy soil under coniferous trees and birches.\n\nCap smooth, greasy, later depressed in the center and at first purplish violet with darker zones, becoming brownish gray or pinkish beige. Gills pale cream, crowded and slightly decurrent. Spores are pale yellow. Stem may be quite long, pallid with tint of cap colour and later often hollow. The mushroom has no ring.\n\nSimilar species Lactarius argillaceflius grows in eastern North America under oaks with gills that stain and age brownish.\n", "edibility": "edible when boiled "},
{"name_latin": "Lactarius torminosus", "name_eng": "Woolly Milkcap", "url": "http://www.mushroom.world/show?n=Lactarius-torminosus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariustorminosus1.JPG", "http://www.mushroom.world/data/fungi/Lactariustorminosus2.JPG", "http://www.mushroom.world/data/fungi/Lactariustorminosus3.JPG", "http://www.mushroom.world/data/fungi/Lactariustorminosus4.JPG", "http://www.mushroom.world/data/fungi/Lactariustorminosus5.JPG", "http://www.mushroom.world/data/fungi/Lactariustorminosus6.JPG"], "description": "Cap 4-12 cm diameter, stem 4-8 cm tall * 1-2 cm thick. Lactarius torminosus, also know as Woolly Milkcap, is a largish, salmon-pink, distinctively woolly agaric that exudes white milk. The mushroom is mycorrhizal with birch and often found in open, grassy sites. \n\nCap at first round with a slightly depressed center and rolled-in margin. Then shallow to severely funnel shaped. It has a shaggy surface that has zones in shades of orange and orange-brown. Gills are pallid buff or salmon, extending downward, narrow, and crowded. Spores are pale yellowish cream. Stem is similarly colored as the cap but more pallid. It is short, smooth more or less equal or tapering at both ends. The mushroom has no ring. \n \nSimilar species Lactarius pubescens is paler with fainter zones.  It has a less shaggy cap. Lactarius scoticus is smaller and also pale.\n", "edibility": "edible when boiled "},
{"name_latin": "Lactarius tabidus", "name_eng": "Birch Milkcap", "url": "http://www.mushroom.world/show?n=Lactarius-tabidus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariustabidus1.JPG", "http://www.mushroom.world/data/fungi/Lactariustabidus2.JPG", "http://www.mushroom.world/data/fungi/Lactariustabidus3.JPG"], "description": "Cap 2-4 cm diameter, stem 3-5 cm tall * 0.4-1 cm thick. Lactarius tabidus, also known as Birch Milkcap, is a small agaric with orange-brown cap, cinnamon gills that exudes white milk. It grows solitary or in scattered groups on soil under broad-leaf trees, favouring birch.\n\nCap convex, sometimes with a central umbo, that flattens with age. It varies between orange-brown and a dull chestnut in colour, and the surface is dry and matt. The margin is often has tiny lobes, and can be crimped or crisped. Gills at first ochraceous-buff, becoming cinnamon, adnate or slightly decurrent, narrow and fairly crowded. Spores are cream coloured. Stem colour varies between a reddish-brown and brick coloured, is more or less equal or tapering slightly upwards. The mushroom has no ring.\n\nSimilar species other small Lactarius species.\n", "edibility": "inedible"},
{"name_latin": "Lactarius rufus", "name_eng": "Red-hot Lactarius", "url": "http://www.mushroom.world/show?n=Lactarius-rufus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariusrufus1.JPG", "http://www.mushroom.world/data/fungi/Lactariusrufus2.JPG", "http://www.mushroom.world/data/fungi/Lactariusrufus3.JPG", "http://www.mushroom.world/data/fungi/Lactariusrufus4.JPG", "http://www.mushroom.world/data/fungi/Lactariusrufus5.JPG", "http://www.mushroom.world/data/fungi/Lactariusrufus6.JPG"], "description": "Cap 3-10 cm diameter, stem 4-8 cm tall * 0.5-2 cm thick. Lactarius rufus, also know as Red-hot Lactarius, is a small to medium-sized agaric has a dull reddish brown cap, creamy white gills and exudes milk that remains white. The flesh tastes very hot after about 30 seconds, but can be eaten only after being salted and then pickled.\n\nCap dry and velvety with a powdery matte texture and never sticky. It is reddish or bay-brown coloured, at first convex with inrolled margin, later flattened or slightly depressed typically with a small central umbo, Gills first creamy white, later more similarly colored as the cap, sub-decurrent, which means they travel partially down the stem and are fairly crowded. Spores are off white. Stem is similarly colored as the cap or more pallid, smooth and tapers off and darkens toward the base. The mushroom has no ring.\n\nSimilar species Lactarus hepaticus exudes white milk that stains yellow as it dries.\n", "edibility": "edible when boiled "},
{"name_latin": "Lactarius mammosus", "name_eng": "", "url": "http://www.mushroom.world/show?n=Lactarius-mammosus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariusmammosus1.JPG", "http://www.mushroom.world/data/fungi/Lactariusmammosus2.JPG", "http://www.mushroom.world/data/fungi/Lactariusmammosus3.JPG", "http://www.mushroom.world/data/fungi/Lactariusmammosus4.JPG", "http://www.mushroom.world/data/fungi/Lactariusmammosus5.JPG"], "description": "Cap 2.5-5.5 cm diameter; stem 3-7 cm tall x 0.5-1 cm diameter. Lactarius mammosus is a largish agaric that has a gray cap and pale gills and stem and exudes white milk. It grows solitary or in scattered groups on boggy soil under coniferous trees, mainly pine.\n\nCap convex, later flattening or with a depression, sometimes with a fiat to pointed umbo, margin at first somewhat inrolled; brownish, vinaceous-grey to umber or hazel, sometimes with one or more concentric bands; moderately thick, firm, surface dry, of feathery, adpressed fibres breaking into small, low, fibrous scales. Gills adnate to slightly decurrent, crowded; rosy buff, later darker with an orange tinge. Milk white; taste mild, then hot or very hot, smell of coconut.Spores Spore print cream. Flesh whitish to buff. Stem whitish or tinged with the cap colour, bruising pale cinnamon-brown. It has no ring.", "edibility": "edible "},
{"name_latin": "Lactarius lignyotus", "name_eng": "Rufous Milkcap", "url": "http://www.mushroom.world/show?n=Lactarius-lignyotus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariuslignyotus1.JPG", "http://www.mushroom.world/data/fungi/Lactariuslignyotus2.JPG", "http://www.mushroom.world/data/fungi/Lactariuslignyotus3.JPG", "http://www.mushroom.world/data/fungi/Lactariuslignyotus4.JPG", "http://www.mushroom.world/data/fungi/Lactariuslignyotus5.JPG"], "description": "Cap 2-10 cm diameter, stem 4-12 cm tall * 0.8 - 1.5 cm thick. Lactarius lignyotus, also known as Rufous Milkcap, is a dark brown, velvety Lactarius that grows under conifers and features fairly well-spaced gills, a long stem that is nearly as dark as the cap. It exudes white milk that usually stains the flesh and the gills pinkish.\n\nCap mid-to dark brown with a velvety surface. As young with an inrolled margin, becoming flat or shallowly depressed, often with a central depression. Gills very slightly decurrent, close or nearly distant; white or whitish, remaining pale until old age, when pinkish to orangish hues often result from drying milk and spore maturation. Stem pale brown to almost white with white base. More or less equal. The mushroom has no ring.\n\nSimilar species Lactarius fuliginosus has a light brown stem, and the hat color is dark brown.\n", "edibility": "inedible"},
{"name_latin": "Lactarius helvus", "name_eng": "Poison Lactarius", "url": "http://www.mushroom.world/show?n=Lactarius-helvus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariushelvus1.JPG", "http://www.mushroom.world/data/fungi/Lactariushelvus2.JPG", "http://www.mushroom.world/data/fungi/Lactariushelvus3.JPG", "http://www.mushroom.world/data/fungi/Lactariushelvus4.JPG", "http://www.mushroom.world/data/fungi/Lactariushelvus5.JPG", "http://www.mushroom.world/data/fungi/Lactariushelvus6.JPG"], "description": "Cap 4-10 cm diameter; stem 3-6 cm tall * 1-2.3 cm diameter. Lactarius helvus, also known as Poison Lactarius, is a medium-sized or large agaric that has a spicy smell, similar to curry. It has a cinnamon-brown cap, buff gills and excluding colourless, transparent milk. It grows solitary or in scattered groups on soil.\n\nCap velvety, initially slightly convex, becoming funnel-shaped as it matures and has a faint zonate (bull's-eye) pattern, beige or light grey at the margins and darkening toward the centre. Gills decurrent, first cream coloured, then darkening to ochre-yellow. The flesh is white or beige, often pink-tinged. Stem  is similarly colored as the cap or more reddish brown, more or less equal. The mushroom has no ring.\n\nSimilar species Lactarius aquifluus is very similar in appearance and grows in North America.\n\n", "edibility": "poisonous"},
{"name_latin": "Lactarius deterrimus", "name_eng": "Orange milkcap", "url": "http://www.mushroom.world/show?n=Lactarius-deterrimus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariusdeterrimus1.JPG", "http://www.mushroom.world/data/fungi/Lactariusdeterrimus2.JPG", "http://www.mushroom.world/data/fungi/Lactariusdeterrimus3.JPG", "http://www.mushroom.world/data/fungi/Lactariusdeterrimus4.JPG", "http://www.mushroom.world/data/fungi/Lactariusdeterrimus5.JPG"], "description": "Cap 3-10 cm diameter, stem 3-6 cm tall * 1.5 - 2 cm diameter. Lactarius deterrimus, also know as Orange milkcap, is a medium to large agaric that has smooth stem, pale carrot gills and exudes green staining orange milk. It grows by itself or in groups scattered throughout soil under conifers, particularly pine and spruce trees.\n\nCap first round with a slightly depressed center and rolled-in margin. Then shallow to funnel shaped. It has orange coloured zones that turn greener with age. Sticky or slippery when wet. Gills dense and slightly extending downward. Same colour as cap. Stem is similar in color as the cap, smooth, Tough, but at the same time delicate and fragile. Flesh dirty gray colored. It turns orange at the edges because of the carrot coloured milky liquid that escapes when broken. The mushroom has no ring.\n\nSimilar species Lactarius deliciosus which grows with pine trees and the poisonous Lactarius helvus.\n\nLactarius deterrimus on the First Nature Web site.\n", "edibility": "edible "},
{"name_latin": "Lactarius deliciosus", "name_eng": "Saffron Milkcap", "url": "http://www.mushroom.world/show?n=Lactarius-deliciosus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariusdeliciosus1.JPG", "http://www.mushroom.world/data/fungi/Lactariusdeliciosus2.JPG", "http://www.mushroom.world/data/fungi/Lactariusdeliciosus3.JPG", "http://www.mushroom.world/data/fungi/Lactariusdeliciosus4.JPG", "http://www.mushroom.world/data/fungi/Lactariusdeliciosus5.JPG"], "description": "Cap 3-10 cm diameter, stem 3-6 cm tall * 1.5 - 2 cm diameter. Lactarius deliciosus, also known as Saffron Milkcap, is an attractive, fairly large, buff agaric with distinctive salmon -pink blotches, pale carrot coloured gills. The mushroom exudes carroty milk, which is a significant characteristic for this mushroom. It grows grows solitary or in scattered groups on soil under conifers, favouring pine trees.\n\nCap first round and bumpy, then convex and as mature flat with a depressed center. The margin stays rolled in until maturity. It has concentrically zoned thin rings in orange and somewhat wider zone in salmon go gray pink. Often with carrot colored patches. Sticky and slippery when wet. Gills at first apricot or saffron, becoming carrot, dull green on bruising, dense and sub-decurrent before abruptly ending. Stem similarly coloured as cap, thick and hard but also fragile, more or less equal, and patterned with different-sized shallow holes in a darker shade.\n\nSimilar species Lactarius deterrimus found with spruce trees has a smooth stem and exudes green staining orange milk.\n\nLactarius \"deliciosus\" group on the First Nature Web site.", "edibility": "edible and good "},
{"name_latin": "Lactarius camphoratus", "name_eng": "Curry Milkcap", "url": "http://www.mushroom.world/show?n=Lactarius-camphoratus", "img_urls": ["http://www.mushroom.world/data/fungi/Lactariuscamphoratus1.JPG", "http://www.mushroom.world/data/fungi/Lactariuscamphoratus2.JPG", "http://www.mushroom.world/data/fungi/Lactariuscamphoratus3.JPG", "http://www.mushroom.world/data/fungi/Lactariuscamphoratus4.JPG", "http://www.mushroom.world/data/fungi/Lactariuscamphoratus5.JPG"], "description": "Cap 2.5-5 cm diameter, stem 3-5 cm tall * 0.4-0.7 cm thick. Lactarius camphoratus, also known as Curry Milkcap, is a smallish agaric with dark red-brown cap, pale gills and exudes white milk which savor of curry. It grows with conifers and deciduous trees, favoring acidic, well drained soil. \n\nCap dark red-brown with central depression or umbo and a furrowed margin. Gills decurrent, medium-spaced and quite thick. Spores are white to cream colored. Stem is pallid and similarly colored as the cap, more or less equal, and finely downy and becoming hollow. The mushroom has no ring.\n\nSimilar species Lactarius rufus and Lactarius helvus have a similar smell.\n\nLactarius camphoratus on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Laccaria laccata", "name_eng": "Common Laccaria", "url": "http://www.mushroom.world/show?n=Laccaria-laccata", "img_urls": ["http://www.mushroom.world/data/fungi/Laccarialaccata1.JPG", "http://www.mushroom.world/data/fungi/Laccarialaccata2.JPG", "http://www.mushroom.world/data/fungi/Laccarialaccata3.JPG", "http://www.mushroom.world/data/fungi/Laccarialaccata4.JPG"], "description": "Cap 1.5-6 cm diameter, stem 5-10 cm tall * 0.6-1 cm thick. Laccaria laccata, also know as Common Laccaria, is a a smallish agaric which is reddish brown throughout and has distant thickish gills and a fibrous stem. It grows in scattered trooping groups on soil in mixed woods and on heaths.\n\nCap typically reddish brow, but may be shades of pink-brown. It has a toothed margin and a slight depression in the center. Gills colored as cap, but becoming powdered white with spores, adnate, thick, broad distant. Stem colored as cap, robust and strongly fibrillose, often twisted and laterally compressed. The mushroom has no ring. \n\nSimilar species Laccaria bicolor has contrasting, pale blue gills. Laccaria proxima is larger with more fibrillose stem. Laccaria ochropurpurea is much larger and has purple gills.\n\n\nLaccaria laccata on the First Nature Web site.\n", "edibility": "edible "},
{"name_latin": "Kuehneromyces mutabilis", "name_eng": "Sheathed Woodtuft", "url": "http://www.mushroom.world/show?n=Kuehneromyces-mutabilis", "img_urls": ["http://www.mushroom.world/data/fungi/Kuehneromycesmutabilis1.JPG", "http://www.mushroom.world/data/fungi/Kuehneromycesmutabilis2.JPG", "http://www.mushroom.world/data/fungi/Kuehneromycesmutabilis3.JPG", "http://www.mushroom.world/data/fungi/Kuehneromycesmutabilis4.JPG", "http://www.mushroom.world/data/fungi/Kuehneromycesmutabilis5.JPG"], "description": "Cap 3-6 cm diameter, stem 3-8 cm tall * 0.5-1 cm thick. Kuehneromyces mutabilis, also known as Sheathed Woodtuft, is a medium-sized agaric that has a bright tan cap which becomes paler from the centre when drying. It also has yellowish or reddish brown gills and a ring on the stem. It grows clustered on stumps and logs of broad-leaf trees, favoring birch.\n\nCap convex, becoming flattened with a blunt umbo, and hygrophanous; as damp shiny and greasy with a deep orange-brown colour towards the rim; often there is a disc of lighter flesh in the middle. Cinnamon-coloured as dry. Gills initially light and later cinnamon brown and broadly attached to the stem and crowded. Sometimes somewhat decurrent. Spores are ochre-brown. Stem pale and smooth light cinnamon above the ring and below darker brown shaggily scaly.\n\nSimilar species A group of poisonous Galerina species are similar. Galerina are unicolor and Galerina marginata have fibers and no stem scales.\n\nWarning: This mushroom is not recommended to be picked as food because it can be confused with the deadly poisonous Galerina marginata.\n\nKuehneromyces mutabilis on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Inocybe lacera", "name_eng": "Torn-cap Inocybe", "url": "http://www.mushroom.world/show?n=Inocybe-lacera", "img_urls": ["http://www.mushroom.world/data/fungi/Inocybelacera1.JPG", "http://www.mushroom.world/data/fungi/Inocybelacera2.JPG", "http://www.mushroom.world/data/fungi/Inocybelacera3.JPG"], "description": "Cap 1-4 cm diameter, stem 2-4 cm tall * 0.2-0.5 cm thick. Inocybe lacera, also know as Torn-cap Inocybe, is in appearance a typical \"little brown mushroom\", but specific features are very variable. It grows often on sandy soil with coniferous trees and on old moss-covered fire sites.\n\nCap snuff-brown, typically convex with a small umbo, fibrillose and scaley. The margin curves inwards, and often splits. Flesh is whitish and unchanging. Gills are cream colored in younger specimens, becoming grey-brown with whitish edges. They are notched at the margin or reach towards but are not attached to the stem. Spores are tobacco brown. Stem brown at the slightly bulbous base, but lighter towards the apex, and fibrillose. The mushroom has no ring.\n\nSimilar species Inocybe lanuginosa has a woollier stem and spores with nodules.\n\n", "edibility": "poisonous"},
{"name_latin": "Hypholoma marginatum", "name_eng": "Snakeskin Brownie", "url": "http://www.mushroom.world/show?n=Hypholoma-marginatum", "img_urls": ["http://www.mushroom.world/data/fungi/Hypholomamarginatum1.JPG", "http://www.mushroom.world/data/fungi/Hypholomamarginatum2.JPG", "http://www.mushroom.world/data/fungi/Hypholomamarginatum3.JPG"], "description": "Cap 1.5-4 cm diameter; stem 3-7 cm tall x 0.2-0.5 cm thick. Hypholoma marginatum, also known as Snakeskin Brownie, is a smallish agaric with tan cap, stem with silvery mottled appearance and yellow or olive-brown gills and no ring zone. It grows in small trooping groups on needles or rotting wood with coniferous trees.\n\nCap  convex, flattening out at maturity but retaining a shallow umbo; inrolled margin of young caps is covered with silky remnants of the partial veil; colour rather variable but most often brick red in the centre and paler towards the margin. Gills at first pallid yellow, then olivaceous-brown, adnate or emarginate, crowded. Spores chocolate-brown. Stem fibrous; light ochre at apex, darkening progressively to a reddish-brown base; a faint ring zone is usually discernable.\n", "edibility": "inedible"},
{"name_latin": "Hypholoma fasciculare", "name_eng": "Sulphur Tuft", "url": "http://www.mushroom.world/show?n=Hypholoma-fasciculare", "img_urls": ["http://www.mushroom.world/data/fungi/Hypholomafasciculare1.jpg", "http://www.mushroom.world/data/fungi/Hypholomafasciculare2.jpg", "http://www.mushroom.world/data/fungi/Hypholomafasciculare3.JPG", "http://www.mushroom.world/data/fungi/Hypholomafasciculare4.JPG", "http://www.mushroom.world/data/fungi/Hypholomafasciculare5.JPG"], "description": "Cap 2-7 cm diameter, 4-10 cm tall * 0.5-1 cm diameter. Hypholoma fasciculare, also known as Sulphur Tuft Mushroom, is a medium-sized agaric that has a yellowish tan cap and stem, sulphur or blackish brown gills, and a faint ring zone. It often grows in clusters on stumps of broad-leaf and coniferous trees.\n\nCap convex, sulphur-yellow with darker orange center. It is expanded with age, smooth but with velar remnants attached to the margin. Flesh is sulphur-yellow, firm and moderate. Gills green sheen on greenish yellow to alove-brown, crowded, adnate.\nStem is more or less similarly colored as the cap, but it is darker brown towards the base. Ring is zone-like, faint, and with maturity same color as spores.\n\nHypholoma fasciculare on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Hypholoma capnoides", "name_eng": "Conifer Tuft", "url": "http://www.mushroom.world/show?n=Hypholoma-capnoides", "img_urls": ["http://www.mushroom.world/data/fungi/Hypholomacapnoides1.JPG", "http://www.mushroom.world/data/fungi/Hypholomacapnoides2.JPG", "http://www.mushroom.world/data/fungi/Hypholomacapnoides3.JPG", "http://www.mushroom.world/data/fungi/Hypholomacapnoides4.JPG", "http://www.mushroom.world/data/fungi/Hypholomacapnoides5.JPG", "http://www.mushroom.world/data/fungi/Hypholomacapnoides6.JPG"], "description": "Cap 3-7 cm diameter, stem 5-8 cm tall, 0.5-1 cm thick. Hypholoma capnoides, also known as Conifer Tuft, is a small or medium sized agaric that has a yellowish orange cap and has veil remnants visible at the pale margin. It is greasy when wet.\n\nCap yellow to orange or brownish colour with pale yellow flesh. Gills initially pale orangish-yellow, pale grey when mature, later darker purple/brown. Spore print dark burgundy/brown. Stem yellowish, somewhat rust-brown below.\n\nSimilar species  Hypholoma fasciculare and Hypholoma sublateritium, which are poisonous, also Hypholoma radicosum which is much rarer but is found in similar sites. \n\nHypholoma capnoides on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Hygrophorus hypothejus", "name_eng": "Late Fall Wax Cap", "url": "http://www.mushroom.world/show?n=Hygrophorus-hypothejus", "img_urls": ["http://www.mushroom.world/data/fungi/Hygrophorushypothejus1.JPG", "http://www.mushroom.world/data/fungi/Hygrophorushypothejus2.JPG", "http://www.mushroom.world/data/fungi/Hygrophorushypothejus3.JPG", "http://www.mushroom.world/data/fungi/Hygrophorushypothejus4.JPG", "http://www.mushroom.world/data/fungi/Hygrophorushypothejus5.JPG"], "description": "Cap 3-7 cm diameter, stem 4-7 cm tall * 0.7-1.4 cm thick. Hygrophorus hypothejus, also known as Late Fall Wax Cap, is a smallish, slimy agaric that has a dull brown cap and distinctive yellowish gills and stem. It grows in trooping groups on soil in pine woods from late autumn to winter.\n\nCap first convex and then flat. Dull olive-brown coloured and center is darker and often concave. The margins stay rolled in for some time. It is covered with a thick, glassy layer of slime, disappearing with age. It becomes very sticky in damp weather.\nGills goes down the stem and are sparse and elastic. At first mild vanilla to butter yellow coloured, and turns orange as mature. Spores are white. Stem is pallid yellow, sometimes tinged with orange, tall and usually thin, more or less equal or tapering slightly downwards. It is sticky below the ring zone. The mushroom has no ring.\n\nSimilar species Hygrophorus locorum is bright yellow and associated with larch. Several other Hygrophorus species, found with pine, are distinguished from Hygrophorus hypothejus by their different coloring.", "edibility": "edible "},
{"name_latin": "Hygrophorus camarophyllus", "name_eng": "Arched Wood Wax", "url": "http://www.mushroom.world/show?n=Hygrophorus-camarophyllus", "img_urls": ["http://www.mushroom.world/data/fungi/Hygrophoruscamarophyllus1.JPG", "http://www.mushroom.world/data/fungi/Hygrophoruscamarophyllus2.JPG", "http://www.mushroom.world/data/fungi/Hygrophoruscamarophyllus3.JPG", "http://www.mushroom.world/data/fungi/Hygrophoruscamarophyllus4.JPG", "http://www.mushroom.world/data/fungi/Hygrophoruscamarophyllus5.JPG"], "description": "Cap 2-7 cm diameter, stem 2.5 - 13 cm tall * 1 - 2 cm thick. Hygrophorus camarophyllus, also known as Arched Wood Wax, is a medium-sized agaric which is distinct because of the dry, streaked cap, white, waxy gills that contrast beautifully with the carbon-brown cap and stem.\n\nCap umbonate and often with a raised boss in center of cap, carbon-brown to gray-black with dark radial streaks. Gills decurrent, sparse, waxy, first white, with age white-gray. Stem top often brighter than other stem but not always, otherwise greyish with ingrown threads, cylindrical or narrowed downward, solid to stuffed. Flesh white, brittle, with mild flavor and pleasant aroma. \n Grows in mossy pine forests all over Scandinavia. Has a fairly modest taste but still a delicacy.", "edibility": "edible "},
{"name_latin": "Hygrophoropsis aurantiaca", "name_eng": "False Chanterelle", "url": "http://www.mushroom.world/show?n=Hygrophoropsis-aurantiaca", "img_urls": ["http://www.mushroom.world/data/fungi/Hygrophoropsisaurantiaca1.JPG", "http://www.mushroom.world/data/fungi/Hygrophoropsisaurantiaca2.JPG", "http://www.mushroom.world/data/fungi/Hygrophoropsisaurantiaca3.JPG", "http://www.mushroom.world/data/fungi/Hygrophoropsisaurantiaca4.JPG", "http://www.mushroom.world/data/fungi/Hygrophoropsisaurantiaca5.JPG"], "description": "Cap 2-8 cm diameter, stem 3-5 cm tall * 0.5-1 cm thick. Hygrophoropsis aurantiaca, also commonly knows as False Chanterelle, is a smallish orange-yellow agaric that has a shallowly funnel-shaped cap reminiscent of a chanterelle but with true gills. It grows typically among needle litter, rotten wood, or sawdust.\n\nCap golden-orange, initially convex but becoming funnel-shaped as the mushroom matures. The cap margin, which remains rolled in a little, becomes wavy or lobed in age. The cap surface is covered with a fine down. Gills decurrent, narrow and forked, which is a distinctive and distinguishing feature. They are generally a more intense shade of orange than the cap. Stem  is similarly colored as the cap. It is stout, more or less equal, smooth, and typically curved. The gills may be slightly crimped along the stem. The mushroom has no ring.\n\nSimilar species Cantharellus cibarius, Omphalotus olearius \n", "edibility": "inedible"},
{"name_latin": "Hydnum rufescens", "name_eng": "Terracotta Hedgehog", "url": "http://www.mushroom.world/show?n=Hydnum-rufescens", "img_urls": ["http://www.mushroom.world/data/fungi/Hydnumrufescens1.JPG", "http://www.mushroom.world/data/fungi/Hydnumrufescens2.JPG", "http://www.mushroom.world/data/fungi/Hydnumrufescens3.JPG", "http://www.mushroom.world/data/fungi/Hydnumrufescens4.JPG", "http://www.mushroom.world/data/fungi/Hydnumrufescens5.JPG", "http://www.mushroom.world/data/fungi/Hydnumrufescens6.JPG"], "description": "Cap 2-6 cm diameter, stem 1.5-4 cm diameter * 0.8-1.5 cm tall. Hydnum rufescens, also known as Terracotta Hedgehog, is a small or medium-sized fruiting body is similar to that of Hydnum repandum but is smaller, thinner and salmon pink colored. It grows on soil in broad-leaf or coniferous woods.\n\nFruiting body is salmon-pink. Cap is smooth or faintly downy; it is at first convex with inrolled margin, becoming flattened and often slightly funnel-shaped. Margin remains incurved. Stem is stout, more or less equal, sometimes eccentric, and finely downy. Flesh is pinkish, soft, thick and rather crumbly. Spines are salmon pink and broadly attached to the stem. Spores are glassy in color.\n\nSimilar species Hydnum repandum.", "edibility": "edible "},
{"name_latin": "Hydnum repandum", "name_eng": "Common Hedgehog Tooth", "url": "http://www.mushroom.world/show?n=Hydnum-repandum", "img_urls": ["http://www.mushroom.world/data/fungi/Hydnumrepandum1.JPG", "http://www.mushroom.world/data/fungi/Hydnumrepandum2.JPG", "http://www.mushroom.world/data/fungi/Hydnumrepandum3.JPG", "http://www.mushroom.world/data/fungi/Hydnumrepandum4.JPG", "http://www.mushroom.world/data/fungi/Hydnumrepandum5.JPG", "http://www.mushroom.world/data/fungi/Hydnumrepandum6.JPG"], "description": "Cap 3-10 cm diameter; stem 2-6 cm tall * 1.5-3 cm diameter. Hydnum repandum, also known as Common Hedgehog Tooth, is a medium-sized to large, fleshy mushroom with pale whitish to pale orange-yellow cap. It grows on soil in broad-leaf or coniferous woods.\n\nFruiting body orange-, yellow- or tan-colored, irregular in shape (it may be convex or concave at maturity), with a wavy margin that is rolled inward when young. The cap surface is generally dry and smooth, although mature specimens may show cracking. Viewed from above, the caps of mature specimens resemble somewhat those of chanterelles. The flesh is thick, white, firm, brittle, and bruises yellow to orange-brown. The underside is densely covered with small, slender off-white to pinkish spines measuring 2–7 mm long. These spines sometimes run down at least one side of the stem. Odor not distinctive. Stem Thick, central of off center; colored like cap or lighter.\n\nSimilar species\nHydnum albidum has a white cap, smaller spores, and occurs on alkaline soil. Closely related Hydnum refescens is smaller and orange.\n\nHydnum repandum on the MushroomExpert.Com Web site.", "edibility": "edible and excellent "},
{"name_latin": "Hortiboletus rubellus", "name_eng": "Ruby Bolete", "url": "http://www.mushroom.world/show?n=Hortiboletus-rubellus", "img_urls": ["http://www.mushroom.world/data/fungi/Hortiboletusrubellus1.jpg", "http://www.mushroom.world/data/fungi/Hortiboletusrubellus2.jpg", "http://www.mushroom.world/data/fungi/Hortiboletusrubellus3.jpg"], "description": "Cap 6 cm; stem 7,5 cm tall * 1-3 cm diameter. Hortiboletus rubellus, also known as Xerocomellus rubellus or Ruby Bolete, is a relatively small bolete with scarlet to raspberry red cap, reddish stem and and yellow pores, occurring largely with oak.\n\nCap scarlet to raspberry red when young, with a dry velvety texture. The extreme margin often has a pale yellow or white band around it, and it discolours darker, and dirtier with age. Pores small; pale yellow, and bruise slowly. Spores the spore print is olive. Stem  slender and long. It is lemon yellow at the apex, but red elsewhere, and has a tendency to split or sheer vertically.\n\nSimilar species Hortiboletus Simonini.\n\nHortiboletus rubellus on the www.first-nature.com web site.\n\nXerocomellus rubellus on the MushroomExpert.Com Web site.", "edibility": "inedible"},
{"name_latin": "Hericium erinaceus", "name_eng": "Lion's mane", "url": "http://www.mushroom.world/show?n=Hericium-erinaceus", "img_urls": ["http://www.mushroom.world/data/fungi/Hericiumerinaceus1.jpg", "http://www.mushroom.world/data/fungi/Hericiumerinaceus2.jpg", "http://www.mushroom.world/data/fungi/Hericiumerinaceus3.JPG"], "description": "Body 8–16 cm across, spines 1-5 cm long. Hericium erinaceus, also known as Lion's mane, is an large, edible mushroom belonging to the tooth fungus group. It grows on cracks or knot holes of living hardwoods, most often oaks in late summer and fall.\n\nFruiting body consists of one, often roundish fruitbody with 1-5 cm long, soft spines hanging from a tough, hidden base that is attached to the tree. The spines are white, or in age discoloring brownish to yellowish. Stem very short if present.\n\nSimilar species Hericium coralloides is found only on wood of conifers and has coarser branches and longer spines in tufts, not in continous rows along lower surfaces.\n\nHericium erinaceus on the MushroomExpert.Com Web site.\n", "edibility": "edible "},
{"name_latin": "Hebeloma mesophaeum", "name_eng": "Veiled Poisonpie", "url": "http://www.mushroom.world/show?n=Hebeloma-mesophaeum", "img_urls": ["http://www.mushroom.world/data/fungi/Hebelomamesophaeum1.JPG", "http://www.mushroom.world/data/fungi/Hebelomamesophaeum2.JPG", "http://www.mushroom.world/data/fungi/Hebelomamesophaeum3.JPG", "http://www.mushroom.world/data/fungi/Hebelomamesophaeum4.JPG", "http://www.mushroom.world/data/fungi/Hebelomamesophaeum5.JPG", "http://www.mushroom.world/data/fungi/Hebelomamesophaeum6.JPG"], "description": "Cap 2.5-4.5 cm diameter, stem 4-7 cm tall * 0.3-0.4 cm thick. Hebeloma mesophaeum, also known as Veiled Poisonpie, is a smallish agaric that has a greasy cap with dark brown centre and paler margin, clay gills and pale stem with ring. It grows solitary or in small groups on soil, with conifers, less frequently with broad-leaf trees on late summer to autumn. The mushroom is moderately poisonous.\n\nCap dry, or slightly greasy, gray-brown, darker chocolate-brown toward center with pallid whitish margin decorated with fibrous velar remnants when young. Gills notched, medium spaced and pale brown coloured.  Spores are rust colored.  Flesh brownish, firm and stuffed. Stem pallid buff, becoming tinged brown with age, more or less equal, sometimes with a faint or more prominent ring zone.\n\nHebeloma mesophaeum on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Hebeloma crustuliniforme", "name_eng": "Poison Pie", "url": "http://www.mushroom.world/show?n=Hebeloma-crustuliniforme", "img_urls": ["http://www.mushroom.world/data/fungi/Hebelomacrustuliniforme1.JPG", "http://www.mushroom.world/data/fungi/Hebelomacrustuliniforme2.JPG", "http://www.mushroom.world/data/fungi/Hebelomacrustuliniforme3.JPG", "http://www.mushroom.world/data/fungi/Hebelomacrustuliniforme4.JPG", "http://www.mushroom.world/data/fungi/Hebelomacrustuliniforme5.JPG"], "description": "Cap 2-10 cm diameter, stem 4-7 cm tall * 1-2 cm thick. Hebeloma crustuliniforme, also known as Poison Pie, is a medium to large agaric with buff or tan, greasy cap, clay gills and stoutish, pale stem. It grows solitary or in small groups on soil in open mixed woodland. The mushroom is moderately poisonous.\n\nCap buff to pale tan, convex then umbonate with an inrolled cap margin until old. Gills pale grey-brown and exude droplets in moist conditions, adnate or adnexed, crowded. Spores are rust colored. Stem whitish, fairly stout, more or less equal, granular towards apex and the thick flesh is white. The mushroom has no ring.\n\nHebeloma crustuliniforme on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Gyromitra infula", "name_eng": "Hooded false morel", "url": "http://www.mushroom.world/show?n=Gyromitra-infula", "img_urls": ["http://www.mushroom.world/data/fungi/Gyromitrainfula1.JPG", "http://www.mushroom.world/data/fungi/Gyromitrainfula2.JPG", "http://www.mushroom.world/data/fungi/Gyromitrainfula3.JPG", "http://www.mushroom.world/data/fungi/Gyromitrainfula4.JPG"], "description": "2-8 cm diameter, 2-13 cm tall, including stem. Gyromitra infula, also known as Hooded false morel, occurs in late summer and fall, not in the spring, when other species of Gyromitra can be found. Its broadly lobed cap is usually pinched into two lobes, creating a saddle-shaped appearance. Its color is variable.\n\nFruiting body occasionally nearly cup-shaped when young, but soon becoming lobed with two prominently raised lobes; bald; loosely wrinkled but usually not not brainlike; varies in color (tan to yellowish brown to reddish brown to dark brown); undersurface whitish to brownish, finely dusted, sometimes ingrown with stem where contact occurs. Stem equal to enlarged at the base, stuffed or hollow, round to compressed, sometimes with a longitudinal fold, surface glabrous to subpubescent, colored like the cap or lighter.\n\nSimilar species The deadly poisonous Gyromitra esculenta reminds of this mushroom.", "edibility": "poisonous"},
{"name_latin": "Gyromitra esculenta", "name_eng": "False Morel", "url": "http://www.mushroom.world/show?n=Gyromitra-esculenta", "img_urls": ["http://www.mushroom.world/data/fungi/Gyromitraesculenta1.JPG", "http://www.mushroom.world/data/fungi/Gyromitraesculenta2.JPG", "http://www.mushroom.world/data/fungi/Gyromitraesculenta3.JPG", "http://www.mushroom.world/data/fungi/Gyromitraesculenta4.JPG", "http://www.mushroom.world/data/fungi/Gyromitraesculenta5.JPG", "http://www.mushroom.world/data/fungi/Gyromitraesculenta6.JPG"], "description": "5-15 cm diameter, 5-12 cm tall, including stem. Gyromitra esculenta, also know as False Morel, has a fruiting body that consists of an irregular, brown, brain-like structure on a pale stem. It grows solitary or in small trooping groups near conifers (pines), typically on acid, sandy soils.\n\nThe irregularly shaped Fruiting body reminds of a brain structure. Initially smooth, it becomes progressively more wrinkled as it grows and ages. The cap colour may be various shades of reddish-, chestnut-, purplish-, bay-, dark or sometimes golden-brown. Stem attached to the cap at several points. Gyromitra esculenta has a solid stipe whereas those of true morels (Morchella spp.) are hollow. The spore print is whitish.\n\nWarning This mushroom is deadly poisonous. Toxins allegedly lost after thorough cooking but, if ingested, the effect is probably cumulative with no immediate symptoms.\n\nSimilar species Gyromitra gigas, Gyromitra brunna, Gyromitra caroliniana and Gyromitra korfii are often larger and more vivid orange-brown; common in parts of North America.\n\nGyromitra esculenta on the MushroomExpert.Com Web site.\n", "edibility": "lethally poisonous"},
{"name_latin": "Gomphidius glutinosus", "name_eng": "Slimy Spike", "url": "http://www.mushroom.world/show?n=Gomphidius-glutinosus", "img_urls": ["http://www.mushroom.world/data/fungi/Gomphidiusglutinosus1.JPG", "http://www.mushroom.world/data/fungi/Gomphidiusglutinosus2.JPG", "http://www.mushroom.world/data/fungi/Gomphidiusglutinosus3.JPG", "http://www.mushroom.world/data/fungi/Gomphidiusglutinosus4.JPG", "http://www.mushroom.world/data/fungi/Gomphidiusglutinosus5.JPG", "http://www.mushroom.world/data/fungi/Gomphidiusglutinosus6.JPG"], "description": "Cap 3-5 cm diameter, stem 2.5-4.5 cm tall * 0.4-1 cm thick. Gomphidius glutinosus, also known as Slimy Spike, is a gray-brown agaric that is covered in a colorless, slimy veil. The stem has an indistinct ring zone, often stained black by spores, and its base is lemon-yellow. The mushroom is mycorrhizal with spruse.\n\nCap gray-brown, convex or bun shaped, becoming expanded and flattened, heavily viscid when damp, becoming shiny when dry. Flesh dirty white, moderate and firm. Gills at first whitish, becoming tinged olivaceous-grey when mature, deeply decurrent, thick. Stem dirty white, more or less equal, lemon yellow at base. Ring white, glutinous, zone-like.\n", "edibility": "edible "},
{"name_latin": "Galerina marginata", "name_eng": "Funeral Bell", "url": "http://www.mushroom.world/show?n=Galerina-marginata", "img_urls": ["http://www.mushroom.world/data/fungi/Galerinamarginata1.jpg", "http://www.mushroom.world/data/fungi/Galerinamarginata2.jpg", "http://www.mushroom.world/data/fungi/Galerinamarginata3.jpg", "http://www.mushroom.world/data/fungi/Galerinamarginata4.jpg", "http://www.mushroom.world/data/fungi/Galerinamarginata5.jpg"], "description": "Cap 2.5-6.5 cm diameter, stem 3-9 cm tall * 0.3-0.8 cm diameter. Galerina marginata, also known as Funeral Bell, is a small agaric with yellowish tan, sticky cap, similarly colored as the gills and a ring on the stem. It grows in clusters on stumps and logs of broad-leaf trees.\n\nCap starts convex, sometimes broadly conical, and has edges (margins) that are curved in against the gills. It becomes later broadly convex and then flattened, sometimes developing a central elevation, or umbo. Gills typically narrow and crowded, with a broadly adnate to nearly decurrent attachment to the stem and convex edges. They are a pallid brown when young, becoming tawny at maturity. Stem more or less equal or is slightly enlarged downward. Initially solid, it becomes hollow from the bottom up as it matures. The membranous ring is located on the upper half of the stem near the cap, but may be sloughed off and missing in older specimens. Above the level of the ring, the stem surface has a very fine whitish powder and is paler than the cap; below the ring it is brown down to the reddish-brown to bistre base. \n\nSimilar species Galerina marginata may be mistaken for a few edible mushroom species like Pholiota mutabilis, Armillaria mellea and Kuehneromyces mutabilis.\n\nGalerina marginata on the First Nature Web site.", "edibility": "lethally poisonous"},
{"name_latin": "Entoloma vernum", "name_eng": "Pinkgill mushroom", "url": "http://www.mushroom.world/show?n=Entoloma-vernum", "img_urls": ["http://www.mushroom.world/data/fungi/Entolomavernum1.JPG", "http://www.mushroom.world/data/fungi/Entolomavernum2.JPG", "http://www.mushroom.world/data/fungi/Entolomavernum3.JPG", "http://www.mushroom.world/data/fungi/Entolomavernum4.JPG", "http://www.mushroom.world/data/fungi/Entolomavernum5.JPG", "http://www.mushroom.world/data/fungi/Entolomavernum6.JPG"], "description": "Cap 2-4 cm diameter, stem 2-7 cm tall * 0.2-0.6 cm thick. Entoloma vernum, also known as Pinkgill mushroom, is a small agaric that has grey-brown cap and stem, with brown gills. It can be seen mainly in spring, but also during summer and autumn, and occur as solitary or in small trooping groups in grasslands, often in the vicinity of conifers.\n\nCap grayish tan or darker, conic to broadly conic, flattening out somewhat but retaining a sharp, central umbo; dry; silky to nearly bald; Flesh brown, thin and fragile. Gills tan-brown or grayish, becoming pinkish, narrowly attached to the stem, or nearly free from it; close or nearly distant.Spores are pink colored. Stem equal, or slightly tapered toward the apex; finely fibrillose near the apex, but nearly bald elsewhere; brownish to tan or brown overall, but paler at the apex. Ring abcent. Flesh same color as surface, pithy or narrowly hollow.\n\nEntoloma vernum on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Entoloma sericeum", "name_eng": "Silky Pinkgill", "url": "http://www.mushroom.world/show?n=Entoloma-sericeum", "img_urls": ["http://www.mushroom.world/data/fungi/Entolomasericeum1.JPG", "http://www.mushroom.world/data/fungi/Entolomasericeum2.JPG", "http://www.mushroom.world/data/fungi/Entolomasericeum3.JPG", "http://www.mushroom.world/data/fungi/Entolomasericeum4.JPG", "http://www.mushroom.world/data/fungi/Entolomasericeum5.JPG", "http://www.mushroom.world/data/fungi/Entolomasericeum6.JPG"], "description": "Cap 2-4 cm diameter, stem 2-7 cm tall * 0.15-0.5 cm thick. Entoloma sericeum, also known as Silky Pinkgill, is a small agaric that has a dark brownish grey cap and stem, with pale gills. It grows solitary, or in small trooping groups on soul in grass and on open moorland.\n\nCap initially conical, developing an umbo as it becomes broadly convex; hygrophanous, darker brown when wet and much paler, often streaky buff when dry; surface smooth with silky radial fibrils. Flesh same color as cap or more pallid.  Gills sinuate; pale grey at first, becoming pinkish grey and eventually brown. Spores are pink. Stem same color as cap, more pallid at the apex and base, silky fibrillose, more or less equal, base slightly swollen. The mushroom has no ring. \n\nSimilar species There are several Entoloma species that are similar in appearance, such as Entoloma cetratum, which is warmer honey brown and Entoloma conferendum which has star-shaped spores.", "edibility": "inedible"},
{"name_latin": "Cystoderma amianthinum", "name_eng": "Earthy Powdercap", "url": "http://www.mushroom.world/show?n=Cystoderma-amianthinum", "img_urls": ["http://www.mushroom.world/data/fungi/Cystodermaamianthinum1.JPG", "http://www.mushroom.world/data/fungi/Cystodermaamianthinum2.JPG", "http://www.mushroom.world/data/fungi/Cystodermaamianthinum3.JPG"], "description": "Cap 2-5 cm diameter, stem 3-5 cm tall * 0.4-0.8 cm thick. Cystoderma amianthinum, also known as Earthy Powdercap or Saffron parasol, is a small to medium, fleshy agaric with ochre-yellow cap, white or cream gills has a coarsely granular stem with ring. It grows solitary or scattered in small tufted groups in damp mossy grassland, in coniferous forest clearings, or on wooded heaths.\n\nCap  ochraceous or yellowish tan, convex to bell-shaped, and later flat with a slight depression around a low umbo (central boss). It is dry and powdery, often with a shaggy or fringed margin. Gills initially white, becoming creamy later. They are adnexed (narrowly attached to the stem), and initially quite crowded. Spore print is white.\nStem cylindrical, and has a flaky-granular sheath beneath a fleeting, powdery ring. Flesh dirty yellow, firm and stuffed.\n\nCystoderma amianthinum on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Craterellus tubaeformis", "name_eng": "Trumpet Chantarelle", "url": "http://www.mushroom.world/show?n=Craterellus-tubaeformis", "img_urls": ["http://www.mushroom.world/data/fungi/Craterellustubaeformis1.JPG", "http://www.mushroom.world/data/fungi/Craterellustubaeformis2.JPG", "http://www.mushroom.world/data/fungi/Craterellustubaeformis3.JPG", "http://www.mushroom.world/data/fungi/Craterellustubaeformis4.JPG"], "description": "Cap 1.5-6 cm dia; stem 3-8 cm tall * 0.4-0.9 cm dia.. Craterellus tubaeformis (formerly Cantharellus tubaeformis) is an edible fungus, also known as Yellowfoot, winter mushroom, or Trumpet Chanterelle. It is small to medium-sized, funnel-shaped, dingy-brown cap has forked veins instead of gills and a yellowish stem. It grows on moss and found mostly in conifer bogs.\n\nCap dark grayish brown, convex and sometimes hollow down the middle. The forked veins are widely separated, and of lighter color than the cap. Stem tall, yellowish, somewhat flattened and hollow and often slightly club-shaped or bulbous at the base. Flesh thin and membranous. \n\nSimilar species Chrysomphalina chrysophylla, which has gills instead of veins.\n\nCantharellus tubaeformis on the First Nature Web site.\n\nCraterellus tubaeformis on the MushroomExpert.Com Web site.", "edibility": "edible and good "},
{"name_latin": "Cortinarius traganus", "name_eng": "Gassy webcap", "url": "http://www.mushroom.world/show?n=Cortinarius-traganus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariustraganus1.JPG", "http://www.mushroom.world/data/fungi/Cortinariustraganus2.JPG", "http://www.mushroom.world/data/fungi/Cortinariustraganus3.JPG", "http://www.mushroom.world/data/fungi/Cortinariustraganus4.JPG", "http://www.mushroom.world/data/fungi/Cortinariustraganus5.JPG"], "description": "Cap 5-8 cm diameter, stem 5-12 cm tall, 0.6-1.2 cm thick. Cortinarius traganus, also known as Gassy webcap, has a convex to umbonate, fleshy, silvery violet cap. It is mycorrhizal, usually with deciduous trees, but also found with conifers, often on acidic soil.\n\nCap initially spherical to convex, with the margin rolled inward, later flattened, sometimes with large, broad, central umbo. The margin often cracks star-like, particularly in dry weather. Color first pale azure violet to pale lilac color, later fading to tan brown or rusty brown. The surface is dry, silkily shiny or tomentose at the margin with membranaceous bronze fragments of the veil, it becomes later cracked into small scales. Gills sub-crowded, quite thick, broadly adnate, and often slightly emarginate. Color slightly dirty violet when young, later brown. Stem tough and thick, bulbously at the base, and spongily stuffed inside. It is vivid violet for a long time in the upper part above the cortina, paler below, and covered with a tough, whitish, boot-like veil, which usually leaves upright zones on the stem. The cortina is violet. The flesh is saffron yellowish-brown to yellowish-brown from the beginning except at the tip of the stem where it is dirty violaceous. It has a strong, bitter taste, particularly when young.\n\nSimilar species Cortinarius malachius has a slightly scaly cap. Cortinarius camphoratus is similar in appearance and is also violet, but it has pale violet gills which soon turn rusty, and a longer stem with paling flesh at the base. It is associated with conifers, as are Cortinarius alboviolaceus.\n\n", "edibility": "inedible"},
{"name_latin": "Cortinarius semisanguineus", "name_eng": "Poison Dye Cort", "url": "http://www.mushroom.world/show?n=Cortinarius-semisanguineus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariussemisanguineus1.JPG", "http://www.mushroom.world/data/fungi/Cortinariussemisanguineus2.JPG", "http://www.mushroom.world/data/fungi/Cortinariussemisanguineus3.JPG", "http://www.mushroom.world/data/fungi/Cortinariussemisanguineus4.JPG", "http://www.mushroom.world/data/fungi/Cortinariussemisanguineus5.JPG"], "description": "Cap 2-6 cm diameter, stem 2-10 cm tall * 0.4-1 cm thick. Cortinarius semisanguineus, also know as Poison Dye Cort, is a medium-sized mushroom with a pale brown to ochre cap, and bright blood-red gills and yellowish stem. It grows typically with conifers and birch.\n\nCap olive- to dark reddish brown, convex to umbonate. Gills blood red, later more reddish rust and adnate, sinuate and fairly crowded. Spores are rusty brown. Stem usually same colour as the cap or paler, smooth, or finely fibrillose like the cap with threadlike remnants of veil. Stem flesh darker red-brown than cap flesh. The mushroom has no ring.\n\nCortinarius semisanguineus on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Cortinarius rubellus", "name_eng": "Deadly Webcap", "url": "http://www.mushroom.world/show?n=Cortinarius-rubellus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariusrubellus1.jpg", "http://www.mushroom.world/data/fungi/Cortinariusrubellus2.jpg", "http://www.mushroom.world/data/fungi/Cortinariusrubellus3.jpg"], "description": "Cap 3-8 cm diameter, stem 5-11 cm tall * 0.8-1.5 cm diameter. Cortinarius rubellus, commonly known as the Deadly Webcap, is a lethally poisonous mushroom which smells of radishes and is reddish orange with a pointed, umbonate cap covered with fibrils.\n\nCap conical to convex (partly flattening to umbonate with maturity). In colour, it is a tawny to date brown with paler margins, and is covered in fine, fibrous scales. The gills are ochre- or caramel-coloured, changing to a deeper brown with age as the spores mature. They have an adnate connection to the stipe. \nThe Stem has a bulbous base. It is the same colour or slightly paler than the cap, and can have yellow fragments of the veil (cortina) attached to its lower half. The flesh is cream or pale yellow, but more tan below the pileipellis and in the stem base. It smells slightly of radishes and has no strong taste.\n\nSimilar species Cortinarius limonius, also poisonous, has more vivid orange coloring. Cortinarius orellanus has a less conical cap and grows near decidous trees.", "edibility": "lethally poisonous"},
{"name_latin": "Cortinarius orellanus", "name_eng": "Fool's Webcap", "url": "http://www.mushroom.world/show?n=Cortinarius-orellanus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariusorellanus1.jpg", "http://www.mushroom.world/data/fungi/Cortinariusorellanus2.jpg"], "description": "Cap 3-7 cm diameter, stem 3-8 cm tall * 0.5-1.3 cm diameter. Cortinarius orellanus, also know as Fool's Webcap, is is a medium sized agaric with tawny brown, bluntu umbonate cap. The gills are colored as the stem. Grows solitary of in scattered trooping groups, with broad-leaf trees. The mushroom is lethally poisonous.\n\nCap bell-shaped, with a sharply inrolled margin at first, expanding to convex or flat, with a broad, low, rounded hump. Surface minutely fibrillose, tending to develop fine, depressed scales. Brownish orange to reddish orange. Margin thin, often flaring in age. Stem cylindrical, becoming hollow. Surface fibrillose; moderate yellow to moderate orange with zones of reddish.\n\nSimilar species Many in Cortinarius and related genera.", "edibility": "lethally poisonous"},
{"name_latin": "Cortinarius mucosus", "name_eng": "Orange Webcap", "url": "http://www.mushroom.world/show?n=Cortinarius-mucosus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariusmucosus1.JPG", "http://www.mushroom.world/data/fungi/Cortinariusmucosus2.JPG", "http://www.mushroom.world/data/fungi/Cortinariusmucosus3.JPG", "http://www.mushroom.world/data/fungi/Cortinariusmucosus4.JPG"], "description": "Cap 6-10 cm diameter, stem 6-10 cm tall * 1-2.5 cm thick. Cortinarius mucosus, also know as Orange Webcap, is a medium to large agaric whit a hat that is yellowish brown and very slimy. It has cinnamon or rust colored gills, a stout white stem with ring zone and slightly swollen base. It grows typically with pine or birch.\n\nCap coloured dark reddish to to orange brown, convex or wavy margined, smooth, very sticky. Gills gray to cinnamon brown, sinuate, adnate. Spores are rusty brown. Stem is white with rust sub-apical cortinal zone. It is smooth or faintly scaly below cap, more or less equal or slightly swollen at base, and very sticky. The mushroom has no ring.\n\nSimilar species Cortinarius collinitus occurs with spruce. It has a blue -tinged slime on its stem. Other similar species grow under different host trees.\n\nCortinarius mucosus on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Cortinarius malicorius", "name_eng": "", "url": "http://www.mushroom.world/show?n=Cortinarius-malicorius", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariusmalicorius1.jpg", "http://www.mushroom.world/data/fungi/Cortinariusmalicorius2.jpg"], "description": "Cap 1.5-5 cm diameter, stem 2-7 cm tall * 0.6-1.2 cm diameter. The young gills of this Cortinarius are orange, which helps to separate it from many similar species. Habitat in coniferous woods.\n\nCap hemispherical then broadly convex; brownish cinnamon, margin more yellow; fibrillose to minutely scaly. Gills Attached to the stem but sometimes pulling away from it in age; close; orange at first, becoming cinnamon to rusty.\nStem middle slightly swollen at the base, soon hollow; bright yellow often with reddish area near the base; corona yellow. Flesh yellow. Odor slight. Taste slight. ", "edibility": "inedible"},
{"name_latin": "Cortinarius laniger", "name_eng": "Woolly Webcap", "url": "http://www.mushroom.world/show?n=Cortinarius-laniger", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariuslaniger1.JPG", "http://www.mushroom.world/data/fungi/Cortinariuslaniger2.JPG", "http://www.mushroom.world/data/fungi/Cortinariuslaniger3.JPG", "http://www.mushroom.world/data/fungi/Cortinariuslaniger4.JPG", "http://www.mushroom.world/data/fungi/Cortinariuslaniger5.JPG"], "description": "Cap 3-8 cm diameter, stem 6-10 cm tall * 1-2 cm thick. Cortinarius laniger, also know as Woolly Webcap, is a medium sized agaric with dull, somewhat tomentose, reddish brown cap and rust -brown gills has pale brown, belted stem tinged lilac at the apex. It grows solitary or in scattered trooping groups on wet mossy soil in or near upland coniferous woods.\n", "edibility": "inedible"},
{"name_latin": "Cortinarius croceus", "name_eng": "Saffron Webcap", "url": "http://www.mushroom.world/show?n=Cortinarius-croceus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariuscroceus1.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscroceus2.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscroceus3.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscroceus4.JPG"], "description": "Cap 1.5 - 3 cm diameter; stem 2.5 - 8.5 cm tall x 0.3-0.5 cm diameter. Cortinarius croceus, also know as Saffron Webcap, is a small agaric with tawny-brown cap, yellowish tawny gills and slender, yellowish stem with faint ring zone grows solitary or in scattered trooping groups on soil in coniferous woods.\n\nCap at first ochraceous-brown, becoming rust colored; finely felty convex, often slightly umbonate, finely fibrillose. Flesh chrome-yellow and fairly thin. Gills at first yellow, then tawny and rust at maturity, adnexed, fairly Crowded. Spores rust. Stem longitudinally fibrillose, cylindrical, solid, surface covered with yellow or yellow-brown veil remnants. Ring absent but with faint superior cortinal zone. Flesh chrome-yellow, fibrous, narrowly hollow, stuffed or full.\n\nCortinarius croceus on the First Nature Web site.\n\nCortinarius croceus on the MushroomExpert.Com Web site.", "edibility": "inedible"},
{"name_latin": "Cortinarius collinitus", "name_eng": "", "url": "http://www.mushroom.world/show?n=Cortinarius-collinitus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariuscollinitus1.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscollinitus2.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscollinitus3.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscollinitus4.JPG"], "description": "Cap 6-10 cm diameter, stem 7-12 cm tall, 1-2.5 cm thick. A orange-brown cap, which is convex or has a wavy margin, and a sturdy white stem are good indicators of this species. Both the cap and the white stem are covered in the slimy remains of the veil which is blue-tinged. The mushroom occurs with spruce.\n\nCap convex to flat in shape, with a sticky, gelatinous surface (in moist conditions). Gills are adnexed, close, and pallid or pale violet in color. Stem solid, equal, and has transverse scaly-looking bands. The spore print, like most Cortiniarius species, is rusty-brown. Edibility is unknown for this species.\n\nSimilar species Cortinarius mucosus.", "edibility": "inedible"},
{"name_latin": "Cortinarius caperatus", "name_eng": "Gypsy Mushroom", "url": "http://www.mushroom.world/show?n=Cortinarius-caperatus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariuscaperatus1.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscaperatus2.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscaperatus3.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscaperatus4.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscaperatus5.JPG", "http://www.mushroom.world/data/fungi/Cortinariuscaperatus6.JPG"], "description": "Cap 5-12 cm diameter, stem 4-10 cm tall * 1-1.5 cm thick. Cortinarius caperatus, also known as Gypsy Mushroom, is egg-shaped on emerging and its cap becomes convex to umbonate with age. It is yellow-brown with a wrinkled surface and remnants of the white to lilac veil in the center. The smooth stem has a narrow, sheathing ring, also known as a partial veil, which is a key identifying feature of the mushroom.\n\nCap yellow-brown to brownish-ochre, which is covered with whitish fibres. The surface has a wrinkled and furrowed texture. It may have a lilac tinge when young. Initially convex before expanding and flattening with a boss (umbo) in the centre. Gills pallid buff or clay, adnate, crowded. Spores are pale brown. Stem slightly swollen at the base, and is whitish with a whitish ring, which is initially attached to the cap.\n\nSimilar species Cortinarius species are related, but have no true stem rings and have rust-brown spores.\n\nCortinarius caperatus on the www.first-nature.com web site.", "edibility": "edible and good "},
{"name_latin": "Cortinarius armillatus", "name_eng": "Red-banded Cort", "url": "http://www.mushroom.world/show?n=Cortinarius-armillatus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariusarmillatus1.JPG", "http://www.mushroom.world/data/fungi/Cortinariusarmillatus2.JPG", "http://www.mushroom.world/data/fungi/Cortinariusarmillatus3.JPG", "http://www.mushroom.world/data/fungi/Cortinariusarmillatus4.JPG"], "description": "Cap 4-12 cm diameter, stem 6-12 cm tall * 1-3 cm thick. Cortinarius armillatus, commonly known as the Red-banded cortinarius, is a medium or large agaric that has a rust-brown, bell-shaped, fibrous cap, rust gills and reddish belts on stem with swollen base. It grows typically in moist coniferous forests, especially spruced ones. \n\nCap bell shaped at first, later flattening out, vividly rust-brown becoming slightly paler with age, with small fibrous scales, often with reddish cortinal remnants forming a belt at margin. Gills dark rust-brown; broad, distant and shallowly sinuate. Spores are rusty brown. Stem is a pallid cap color streaked with fibrils, more or less equal but markedly swollen at base. Ring is made of velar remnants forming one or more orange-red median or inferior ring zones. Flesh is light brown.\n\nCortinarius armillatus on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Cortinarius alboviolaceus", "name_eng": "Silvery Violet Cort", "url": "http://www.mushroom.world/show?n=Cortinarius-alboviolaceus", "img_urls": ["http://www.mushroom.world/data/fungi/Cortinariusalboviolaceus1.JPG", "http://www.mushroom.world/data/fungi/Cortinariusalboviolaceus2.JPG", "http://www.mushroom.world/data/fungi/Cortinariusalboviolaceus3.JPG"], "description": "Cap 5-8 cm diameter, stem 5-12 cm tall * 1-2 cm thick. Cortinarius alboviolaceus, also called Silvery violet cort, has a convex to umbonate, fleshy, silvery violet cap. It grows with deciduous trees, but also found with conifers, often on acidic soil. \n\nCap at first domed and then shallowly convex with a broad umbo, the dry, silky caps vary in colour from almost white through pale lilac to pale mauve. The rather broad, sinuate, notched gills are medium spaced and light gray-blue to cinnamon-brown. Stem The twisted, often club-shaped stem is often bowed rather than straight, is pale and fibrous with a slightly clavate (club-shaped) base and sometimes marked rust-brown around the veil zone by deposited spores. \n\nSimilar species Cortinarius malachius has a slightly scaly cap. It is associated with conifers, as are Cortinarius camphoratus and Cortinarius tranganus, which are noted for their penetrating smells; the former reminiscent of half-rotten potatoes, the latter sweet and sticky.\n\nCortinarius alboviolaceus on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Coprinus plicatilis", "name_eng": "Umbrella Inky Cap", "url": "http://www.mushroom.world/show?n=Coprinus-plicatilis", "img_urls": ["http://www.mushroom.world/data/fungi/Coprinusplicatilis1.JPG", "http://www.mushroom.world/data/fungi/Coprinusplicatilis2.JPG", "http://www.mushroom.world/data/fungi/Coprinusplicatilis3.JPG", "http://www.mushroom.world/data/fungi/Coprinusplicatilis4.JPG", "http://www.mushroom.world/data/fungi/Coprinusplicatilis5.JPG", "http://www.mushroom.world/data/fungi/Coprinusplicatilis6.JPG"], "description": "Cap 0.8–2 cm; stem 4-8 cm tall * 1-2 mm diameter. Parasola plicatilis, also known as Parasola plicatilis or Umbrella inky cap is a small parasol-like agaric that can be found in grassy areas, alone, scattered or in small groups. The fruiting bodies grow at night after rain, and will self decompose after spore dispersion is achieved. \n\nCap buff, more cinnamon at the centre and later with gray tinge at the margin. The shape is ovoid at first, becoming convex or bell-shaped, then flat and finally shallowly convex like a parasol. Gills pallid clay,  soon grey and finally black; free from the stem; close or nearly distant. Stem white or buff, equal above a slightly swollen base; fragile; hollow; bald or very finely silky. The mushroom has no ring. \n\nSimilar species Coprinus auricomus tends to be a bit bigger and has browner cap. A microscope reveals thick-walled brown hairs, confirming it's identity. Other similar species include Coprinus keuhneri, Coprinus leiocephalus and Coprinus nudiceps. They can be distinguished only by carefully measuring the spores.\n\nParasola plicatilis on the First Nature Web site.", "edibility": "inedible"},
{"name_latin": "Coprinus comatus", "name_eng": "Shaggy-mane Inky Cap", "url": "http://www.mushroom.world/show?n=Coprinus-comatus", "img_urls": ["http://www.mushroom.world/data/fungi/Coprinuscomatus1.JPG", "http://www.mushroom.world/data/fungi/Coprinuscomatus2.JPG", "http://www.mushroom.world/data/fungi/Coprinuscomatus3.JPG", "http://www.mushroom.world/data/fungi/Coprinuscomatus4.JPG", "http://www.mushroom.world/data/fungi/Coprinuscomatus5.JPG"], "description": "Cap 5-15 cm tall * variable diameter, stem 10-30 cm tall * 1.5-2.5 cm thick. Coprinus comatus, also known as shaggy-mane ink cap, or lawyer's wig is a common fungus which has a white, conical, shaggy cap which blackens. It grows in scattered trooping groups on soil in short grass.\n\nCap almost cylindrical  and initially covers most of its stem, becomes later conical. It is mostly white with shaggy scales, which are more pale brown at the apex. Gills free, colour change rapidly from white to pink, then to black. It is deliquescent. Spores are black. Stem is white, smooth, often very tall, slightly swollen at base and sometimes rooting. It has a loose ring which is white, thin and often slipping down stem towards base. The flesh is white, hollow and fragile and the taste mild.\n\nCoprinus comatus on the First Nature Web site.", "edibility": "edible and good "},
{"name_latin": "Coprinopsis atramentaria", "name_eng": "Common Ink Cap", "url": "http://www.mushroom.world/show?n=Coprinopsis-atramentaria", "img_urls": ["http://www.mushroom.world/data/fungi/Coprinopsisatramentaria1.JPG", "http://www.mushroom.world/data/fungi/Coprinopsisatramentaria2.JPG", "http://www.mushroom.world/data/fungi/Coprinopsisatramentaria3.JPG", "http://www.mushroom.world/data/fungi/Coprinopsisatramentaria4.JPG", "http://www.mushroom.world/data/fungi/Coprinopsisatramentaria5.JPG", "http://www.mushroom.world/data/fungi/Coprinopsisatramentaria6.JPG"], "description": "Cap 3-7 cm tall * variable diameter, stem 7-14 cm tall * 1-1.5 cm thick. Coprinopsis atramentaria, commonly known as the common ink cap, inky cap or alcohol inky cap, is poisonous, when combined with alcohol. It is a medium-sized conical agaric, that is greyish brownish and later blackening. It grows generally in tufts, in fields, gardens and waste ground, near broad-leaf tree stumps or buried wood. \n\nCap egg-shaped, expanding to become slightly umbonate with age. The colour is gray to gray-brown. Flesh is white, hollow and medium in young specimens but soon discolors and deliqueces slowly from the margin. Gills free, extremely crowded and edged with white. Spores are black. Stem is white and smooth with fine, reddish brown fibrils at base. \n\nSimilar species Coprinus insignis has warty spores. Coprinus micaeus is smaller and more fragile. It granulates when young.\n\nCoprinopsis atramentaria on the First Nature Web site.", "edibility": "poisonous"},
{"name_latin": "Coltricia perennis", "name_eng": "Tiger's Eye", "url": "http://www.mushroom.world/show?n=Coltricia-perennis", "img_urls": ["http://www.mushroom.world/data/fungi/Coltriciaperennis1.JPG", "http://www.mushroom.world/data/fungi/Coltriciaperennis2.JPG", "http://www.mushroom.world/data/fungi/Coltriciaperennis3.JPG", "http://www.mushroom.world/data/fungi/Coltriciaperennis4.JPG", "http://www.mushroom.world/data/fungi/Coltriciaperennis5.JPG"], "description": "Cap 2-8 cm diameter, stem 0.2-1 cm thick * 1.3-3.5 cm tall. Coltricia perennis, also known as Tiger's Eye, is an annual polypore that is very unusual in that it grows in the soil rather than on dead wood. It prefers humus-rich sandy soil on woodland edges and on acidic heathland.\n\nFruiting body upper surface zoned concentrically in shades of ochre, grey and rust with maroon tinge, disc-like, at first finely downy, becoming smooth with age; stem rusty-brown, downy, more or less central. Flesh brown, thin, corky, harder when dry.\n\nSimilar species Several tooth-fungi are similar above but have spiny undersides.\n", "edibility": "inedible"},
{"name_latin": "Collybia dryophila", "name_eng": "Russet Toughshank", "url": "http://www.mushroom.world/show?n=Collybia-dryophila", "img_urls": ["http://www.mushroom.world/data/fungi/Collybiadryophila1.JPG", "http://www.mushroom.world/data/fungi/Collybiadryophila2.JPG", "http://www.mushroom.world/data/fungi/Collybiadryophila3.JPG", "http://www.mushroom.world/data/fungi/Collybiadryophila4.JPG"], "description": "Cap 2-6 cm diameter, stem 2-6 cm tall * 0.2-0.5 cm diameter. Collybia dryophila, also known as Gymnopus dryophilus, is a smallish agaric has a pale tan cap, whitish gills, and a flushed tan stem. The mushroom occurs in troops or more or less tufted on soil and scattered leaves under leafy and coniferous trees.\n\nCap convex, and russet to ochre. Gills only thinly attached to the stem, whitish and crowded. Spores are white. Stem more or less similarly colored as the cap, more or less equal but slightly bulbous at base. The mushroom has no ring.\n\nSimilar species Collybia aquosa has pale pink rhizoids and Collybia ocior has a rather dark cap and pale yellow gills.\n\nSynonyms the mushroom is now known under the name Gymnopus dryophilus.\n\nGymnopus dryophilus (Collybia dryophila) on the www.first-nature.com web site.\n", "edibility": "inedible"},
{"name_latin": "Clitopilus prunulus", "name_eng": "Dread Dough Clitopilus", "url": "http://www.mushroom.world/show?n=Clitopilus-prunulus", "img_urls": ["http://www.mushroom.world/data/fungi/Clitopilusprunulus1.JPG", "http://www.mushroom.world/data/fungi/Clitopilusprunulus2.JPG", "http://www.mushroom.world/data/fungi/Clitopilusprunulus3.jpg"], "description": "2-3 cm diameter * 2-3 cm tall. A pale gray-white cap and decurrent, pale pink gills, combined with a strong smell of fresh bread dough, distinguish this species. \n\nCap white or light gray or yellow, convex to funnel-shaped that may have inrolled margin, sticky when moist. Gills decurrent, spaced together rather closely, and whitish, although they often develop a pinkish hue in age. Stem is central or off-center and is similar in color to the cap.\n\nSimilar species Species of Clitocybe and Entoloma can look very similar and are poisonous.\n\nClitopilus prunulus on the First Nature Web site.", "edibility": "edible "},
{"name_latin": "Clitocybe nebularis", "name_eng": "Clouded Funnel Cap", "url": "http://www.mushroom.world/show?n=Clitocybe-nebularis", "img_urls": ["http://www.mushroom.world/data/fungi/Clitocybenebularis1.JPG", "http://www.mushroom.world/data/fungi/Clitocybenebularis2.JPG", "http://www.mushroom.world/data/fungi/Clitocybenebularis3.JPG", "http://www.mushroom.world/data/fungi/Clitocybenebularis4.JPG", "http://www.mushroom.world/data/fungi/Clitocybenebularis5.jpg"], "description": "Cap 8-20 cm diameter, stem 5-10 cm tall * 1.4-4 cm diameter. Clitocybe nebularis or Lepista nebularis, commonly known as the clouded agaric or cloud funnel cap, has convex to flattened or slightly depressed, cloud-grey cap and white, decurrent gills. It grows typically in troops or rings on soil in  broad leaf or coniferous woods.\n\nCap soft cloud-grey, darker at the middle, sometimes with brownish ting. It is convex with an incurved margin, becoming plane to depressed in shape. The surface is usually dry to moist, and radially fibrillose. Gills crowded, pale cream and slightly decurrent. Stem colored as cap, fibrillose, stout, tapering upwards. The mushroom has no ring. Flesh thick and white.\n\nClitocybe nebularis on the www.first-nature.com web site.\n", "edibility": "inedible"},
{"name_latin": "Clitocybe gibba", "name_eng": "Common Funnel Cap", "url": "http://www.mushroom.world/show?n=Clitocybe-gibba", "img_urls": ["http://www.mushroom.world/data/fungi/Clitocybegibba1.JPG", "http://www.mushroom.world/data/fungi/Clitocybegibba2.JPG", "http://www.mushroom.world/data/fungi/Clitocybegibba3.JPG", "http://www.mushroom.world/data/fungi/Clitocybegibba4.JPG", "http://www.mushroom.world/data/fungi/Clitocybegibba5.JPG", "http://www.mushroom.world/data/fungi/Clitocybegibba6.JPG"], "description": "Cap 3-8 cm diameter, stem 3-8 cm tall * 0.5-1 cm thick. Clitocybe gibba is a hardwood-loving mushroom that features a pinkish tan cap that becomes fairly deeply vase-shaped by maturity. Its pale, crowded gills run down the stem, which is pale in comparison to the cap. It grows solitary or in small troops on soil in broad-leaf woods and on heaths from July to September.\n\nCap is pink-tinged, leather brown and smooth, silky, and funnel-shaped, typically with a wavy margin. Flesh is soft and white with a fruity smell. Gills are closely spaced, white and deeply extended downward. Stem is similarly colored as the cap. It is smooth and more or less equal apart from a slightly swollen base. The mushroom has no ring.Spores are white-cream colorcolored. \n\nClitocybe gibba on the www.first-nature.com web site.", "edibility": "inedible"},
{"name_latin": "Clitocybe clavipes", "name_eng": "Club-footed Clitocybe", "url": "http://www.mushroom.world/show?n=Clitocybe-clavipes", "img_urls": ["http://www.mushroom.world/data/fungi/Clitocybeclavipes1.JPG", "http://www.mushroom.world/data/fungi/Clitocybeclavipes2.JPG", "http://www.mushroom.world/data/fungi/Clitocybeclavipes3.JPG", "http://www.mushroom.world/data/fungi/Clitocybeclavipes4.JPG", "http://www.mushroom.world/data/fungi/Clitocybeclavipes5.JPG"], "description": "Cap 4-8 cm diameter, stem 3-7 cm tall * 1-1.5 cm thick. Clitocybe clavipes, commonly known as the club-foot or club-footed clitocybe is identified by it's club-shaped stem, which is swollen at the base and tapering toward the top and funnel-shaped cap with white girls that extend downward. It grows solitary or in small troops on soil in broad-leaf woods, favorfavoring beech.\n\nCap convex with a small boss, becoming plane to depressed in shape. It has a smooth surface. Cap colours are generally grey-brown, sometimes tinged olive, with a pale margin. Gills are strongly decurrent and cream-yellow in colour, contrasting with the rest of the mushroom. There are some smaller gills in between the regular gills, and the gills are occasionally forked near the stem. The gill edges are straight in younger mushrooms and sometimes wavy (undulate) in older ones. Flesh white, but slightly yellow at the base. Stem bulbous base, its surface is covered in silky fibres, and it is the same colour as the cap.\n\nSynonyms the newer name for Clitocybe clavipes is Ampulloclitocybe clavipes.\n\nAmpulloclitocybe clavipes (Clitocybe clavipes) on the www.first-nature.com web site.", "edibility": "inedible"},
{"name_latin": "Chalciporus piperatus", "name_eng": "Peppery Bolete", "url": "http://www.mushroom.world/show?n=Chalciporus-piperatus", "img_urls": ["http://www.mushroom.world/data/fungi/Chalciporuspiperatus1.JPG", "http://www.mushroom.world/data/fungi/Chalciporuspiperatus2.JPG", "http://www.mushroom.world/data/fungi/Chalciporuspiperatus3.JPG", "http://www.mushroom.world/data/fungi/Chalciporuspiperatus4.JPG", "http://www.mushroom.world/data/fungi/Chalciporuspiperatus5.JPG", "http://www.mushroom.world/data/fungi/Chalciporuspiperatus6.JPG"], "description": "Cap 3-5 cm diameter, stem 4-6 cm tall * 0.3-1 cm thick. Chalciporus piperatus, also know as Peppery Bolete, is a very small bolete that is cinnamon-brown throughout, except for the chrome-yellow stem flesh; it does not stain blue on bruising. The slightly greasy cap is convex in shape, and the stem is slender; the tubes are 0.3-1 cm long. The flesh has an intensely hot and peppery flavor, making this species inedible, although is has been used as spice.\n\nCap initially convex before flattening out in age, tubes are adnate to decurrent. Pores are angular cinnamon to rust brown. Spores are susty brown.\n\nSimilar species Chalciporus piparatoides it similar but can be distinguished by the blue bruising of its cap, tubes, and pores. Chalciporus amarellus has pinker coloring and a less peppery taste.\n\nChalciporus piperatus on the MushroomExpert.Com Web site.\n", "edibility": "inedible"},
{"name_latin": "Cantharellus cibarius", "name_eng": "Common Chantarelle", "url": "http://www.mushroom.world/show?n=Cantharellus-cibarius", "img_urls": ["http://www.mushroom.world/data/fungi/Cantharelluscibarius1.JPG", "http://www.mushroom.world/data/fungi/Cantharelluscibarius2.JPG", "http://www.mushroom.world/data/fungi/Cantharelluscibarius3.JPG", "http://www.mushroom.world/data/fungi/Cantharelluscibarius4.JPG", "http://www.mushroom.world/data/fungi/Cantharelluscibarius5.JPG", "http://www.mushroom.world/data/fungi/Cantharelluscibarius6.JPG"], "description": "Cap 3-10 cm across, stem 2-10 cm tall * 0.4-1.5 cm thick. This mushroom is typically orange or yellow, meaty and funnel-shaped. On the lower surface, underneath the smooth cap, it has gill-like ridges that run almost all the way down its stem, which tapers down seamlessly from the cap. \n\nCap light yellow, bright yellow to orange in colour, fading with age. As young formed as a button and then turns more cone shaped. The margin stays folded in for a long time and then often becomes wavy and uneven at maturity. The mushroom has gill-like veins under the cap, not gills. Flesh firm, thick, yellow. Stem solid, tapers downward from cap. The surface is smooth and the colour similar to the cap or a lighter yellow to almost white. \n\nSimilar spiecies Hygrophoropsis aurantiaca which is not mycorrhizal. Can also be confused with the poisonous mushrooms Omphalotus olearius, which has a luminous quality and grows on dead wood, and Cortinarius speciosissimus.\n\nCantharellus cibarius on the First Nature Web site.\n", "edibility": "edible and excellent "},
{"name_latin": "Cantharellula umbonata", "name_eng": "Grayling", "url": "http://www.mushroom.world/show?n=Cantharellula-umbonata", "img_urls": ["http://www.mushroom.world/data/fungi/Cantharellulaumbonata1.JPG", "http://www.mushroom.world/data/fungi/Cantharellulaumbonata2.JPG", "http://www.mushroom.world/data/fungi/Cantharellulaumbonata3.JPG", "http://www.mushroom.world/data/fungi/Cantharellulaumbonata4.JPG"], "description": "cap 2-3 cm dia; stem 2.5-12.5 cm tall * 0.3-0.7 cm dia.. This is a small to medium-sized, funnel-shaped agaric with grey cap and forked gills grows associated with Polytrichum moss and fruits in the summer and fall.\n\nCap convex at first, becoming flat to sunken; most specimens with a small, pointed umbo; margin incurved at first, becoming upturned and wavy in age; surface gray to grayish brown overall, often appearing to have whitish blotches; dry to moist; smooth to minutely hairy; flesh white; odor and taste not distinctive. Gills close to crowded, decurrent, repeatedly and regularly forked; whitish, developing spot-like reddish or sometimes yellow stains in age. Stem often with swollen portions; some-what flexible, often bent, curved, and/or twisted; white to gray; silky above, stuffed, usually with whitish mycelium binding the lower stalk to mass; often water-saturated near the base. Spore print white.", "edibility": "edible "},
{"name_latin": "Calocybe persicolor", "name_eng": "Pink Lawn Trich", "url": "http://www.mushroom.world/show?n=Calocybe-persicolor", "img_urls": ["http://www.mushroom.world/data/fungi/Calocybepersicolor1.jpg"], "description": "Cap 3-5 cm diameter, stem 3-5 cm tall * 0.3-0.8 cm diameter. Calocybe persicolor is a small pink-capped mushroom with white gills that can be found in grassy meadows, fields, or on lawns from spring to autumn. It is less frequently found in open grasslands.\n\nCap convex to umbonate, smooth fleshy and pink coloured. It has a somewhat irregular margin and is covered with whitish dust or bloom.  The flesh is white with pink tinge beneath cuticle. Gills are white, crowded, sinuate and notched. Stem pallid similarly colored as the cap. Smooth, fleshy, tapers slightly upwards.", "edibility": "inedible"},
{"name_latin": "Calocybe gambosa", "name_eng": "St George's Mushroom", "url": "http://www.mushroom.world/show?n=Calocybe-gambosa", "img_urls": ["http://www.mushroom.world/data/fungi/Calocybegambosa1.JPG", "http://www.mushroom.world/data/fungi/Calocybegambosa2.JPG", "http://www.mushroom.world/data/fungi/Calocybegambosa3.JPG"], "description": "Cap 5-15 cm diameter; stem 3-7 cm tall x 2-3 cm diameter. Calocybe gambosa, commonly known as St. George's mushroom, is an edible, medium to large, fleshy, cream mushroom which typically grows in rings or troops on soil. It is most commonly found in pastures but also less frequently appearing in mixed woods.\n\nCap white-creamy coloured to bright yellow, often with brownish tinge. At first sub-spherical, becoming expanded and irregularly convex with an incurved margin. Gills sinuate, white and crowded. The flesh is thick and soft and has a mealy or cucumber smell. The spore print is white to pinkish white.  Stem whitish, smooth, bulky at the base. The mushroom has no ring.\n\nSimilar species Spring fruiting white Entoloma species are distinguished by pink spore deposits and pink mature gills.", "edibility": "edible "},
{"name_latin": "Calocera viscosa", "name_eng": "Yellow Stagshorn", "url": "http://www.mushroom.world/show?n=Calocera-viscosa", "img_urls": ["http://www.mushroom.world/data/fungi/Caloceraviscosa1.JPG", "http://www.mushroom.world/data/fungi/Caloceraviscosa2.JPG"], "description": "3-10 cm tall. This is a yellow, antler-like, gelatinous fungus which grows in tufts or stumps and roots of coniferous trees. It fruits throughout the year, but is most commonly seen in autumn.\n\nFruiting body bright orange, yellow or occasionally white branching basidiocarps, which are somewhat gelatinous and somewhat slimy when wet. Branches are sometimes flattened and sometimes forked at tips.\n\nSimilar species Calocera cornea has small, unbrached clubs and grows on deciduous twigs. Calocera furcata is forked and grows on pine wood. Paler Calocera pallidospathulata is flattened and irregular. Gymnospoarngium clavariiforme, found on juniper, is less erect and without branches at the tips.", "edibility": "inedible"},
{"name_latin": "Bovista plumbea", "name_eng": "Paltry Puffball", "url": "http://www.mushroom.world/show?n=Bovista-plumbea", "img_urls": ["http://www.mushroom.world/data/fungi/Bovistaplumbea1.JPG", "http://www.mushroom.world/data/fungi/Bovistaplumbea2.JPG", "http://www.mushroom.world/data/fungi/Bovistaplumbea3.JPG", "http://www.mushroom.world/data/fungi/Bovistaplumbea4.JPG", "http://www.mushroom.world/data/fungi/Bovistaplumbea5.JPG"], "description": "2-3 cm diameter * 2-3 cm tall. This small, white, puffball, often referred to as the paltry puffball, is attached to the stony surface by several strands. It often live scattered to clustered in disturbed areas, especially in sparse grass and pastures.\n\nFruiting body attached to the substrate by a tuft of mycelium, and spherical to slightly compressed. The surface is white, becoming buff to pale-tan and minutely tomentose. It is falling away in flakes at maturity to reveal dark grey papery contents. Spores are olive to sepia-brown.\n\nBovista plumbea on the www.first-nature.com web site.", "edibility": "edible "},
{"name_latin": "Bondarzewia berkeleyi", "name_eng": "Berkeley's polypore", "url": "http://www.mushroom.world/show?n=Bondarzewia-berkeleyi", "img_urls": ["http://www.mushroom.world/data/fungi/Bondarzewiaberkeleyi1.jpg", "http://www.mushroom.world/data/fungi/Bondarzewiaberkeleyi2.jpg", "http://www.mushroom.world/data/fungi/Bondarzewiaberkeleyi3.jpg"], "description": "Fruiting Body 25-40 cm across. Bondarzewia berkeleyi, commonly known as Berkeley's polypore, or stump blossoms, is a species of polypore fungus in the family Russulaceae. It is a parasitic species that causes butt rot in oaks and other hardwood trees. Although Bondarzewia berkeleyi is edible, it has been compared to eating shoe leather.\n\nFruiting body The fan- or shelf-shaped caps grow in overlapping clumps from the bases of oak trees, each capable of growing to 25.5 cm diameter. They are various shades of white to pale grey, cream, beige or yellow. The pore surface is white, as is the spore print. The outer edges that cut easily with a knife are quite tender.", "edibility": "edible "},
{"name_latin": "Boletus subtomentosus", "name_eng": "Yellow-cracking Bolete", "url": "http://www.mushroom.world/show?n=Boletus-subtomentosus", "img_urls": ["http://www.mushroom.world/data/fungi/Boletussubtomentosus1.JPG", "http://www.mushroom.world/data/fungi/Boletussubtomentosus2.JPG", "http://www.mushroom.world/data/fungi/Boletussubtomentosus3.JPG", "http://www.mushroom.world/data/fungi/Boletussubtomentosus4.JPG", "http://www.mushroom.world/data/fungi/Boletussubtomentosus5.JPG", "http://www.mushroom.world/data/fungi/Boletussubtomentosus6.JPG", "http://www.mushroom.world/data/fungi/Boletussubtomentosus7.JPG"], "description": "Cap 5-12 cm diameter, stem 3-8 cm tall * 1-2 cm diameter. This medium to large bolete is commonly known as suede bolete or yellow-cracked bolete. It has a brown cap, chrome-yellow pores, and yellowish stem and grows with a wide range of hardwood and conifer trees.\n\nCap pale olive or tan, initially convex before flattening with a velvety tan surface, often becoming cracked in age. Flesh is white or pallid yellow, with a faint brownish zone beneath the cap cuticle; it is unchanging, thick and soft. The pore surface is yellow, becoming olive yellow with maturity and bruise blue or green before fading somewhat. Stem is a pallid cap color, sometimes with a brick-red tinge; it is slender and slightly bulbous. The mushroom has no ring. Flesh is similarly colored as the cap but browner.\n\nSimilar species Boletus chrysenteron has a reddish brown cap that cracks to reveal a red underlayer. Boletus pruinatus is smaller.\n\nBoletus subtomentosus on the www.first-nature.com web site.", "edibility": "edible "},
{"name_latin": "Boletus satanas", "name_eng": "Satan's Bolete", "url": "http://www.mushroom.world/show?n=Boletus-satanas", "img_urls": ["http://www.mushroom.world/data/fungi/Boletussatanas1.jpg", "http://www.mushroom.world/data/fungi/Boletussatanas2.jpg"], "description": "Cap 8-25 cm diameter, stem 6-9 cm tall * 5-10 cm diameter. This lethally poisonous fleshy bolete has a smooth, bun-shaped cap that is almost white. Boletus satanas is best identified by its orange to blood-red pores and prominent yellow to blood-red net pattern. It also has a fat, yellow to red stem.\n\nCap compact, at first it is hemispheric with an inrolled margin, later flattening in the shape of a pad, and in older specimens it is bent irregularly. The pileus at first greyish white, later more greenish ochre or leather colour. The surface of the cap is finely tomentose, later smooth and often slightly sticky in wet weather. Pores are small, circular and red, sometimes blood-red, but orange at margin. The free to slightly adnate tubes are yellow then olive, blue where cut. Stem yellow background covered with a hexagonal close-meshed net that starts bright red and turns dark blood-red. Often very bulbous and usually wider than it is long. When young almost spherical. \n", "edibility": "lethally poisonous"},
{"name_latin": "Boletus pinophilus", "name_eng": "Pinewood King Bolete", "url": "http://www.mushroom.world/show?n=Boletus-pinophilus", "img_urls": ["http://www.mushroom.world/data/fungi/Boletuspinophilus1.jpg", "http://www.mushroom.world/data/fungi/Boletuspinophilus2.JPG", "http://www.mushroom.world/data/fungi/Boletuspinophilus3.JPG", "http://www.mushroom.world/data/fungi/Boletuspinophilus4.JPG", "http://www.mushroom.world/data/fungi/Boletuspinophilus5.JPG", "http://www.mushroom.world/data/fungi/Boletuspinophilus6.JPG"], "description": "Cap 6–15(20) cm; stem 5-15 cm tall * 4-7 cm diameter. This is a large bolete with dark brown cap, cream pores, reddish brown netted, bulbous stem, commonly known as the pine bolete or pinewood king bolete. It grows solitary or scattered on soil particularly with Scots pine in Britain. The mushroom prefers the poor, acidic, and sandy soils associated with coniferous forests.\n\nCap deep red-brown or copper coloured. Stays convex for a while, but eventually flattens out. Often irregular in shape when mature. The surface is hard, dimpled and rough and sticky when damp. The flesh is white, tinged cap color beneath the cuticle, unchanging, thick, fairly firm. Pores white then cream colored, becoming olivaceous-brown with age, circular and small. Spores pallid olivaceous-yellow colored. Stem thick and egg pr pear shaped when young. The network pattern is dark brown at the bottom and gets lighter towards the cap. Flesh white, unchanging and fairly firm. The mushroom has no ring.\n\nSimilar species The closely related Boletus edulis has brown color and grows with Pine. Tylopilus felleus is similar when young but tastes bitter and is thus inedible.", "edibility": "edible and excellent "},
{"name_latin": "Boletus edulis", "name_eng": "King Bolete", "url": "http://www.mushroom.world/show?n=Boletus-edulis", "img_urls": ["http://www.mushroom.world/data/fungi/Boletusedulis1.JPG", "http://www.mushroom.world/data/fungi/Boletusedulis2.JPG", "http://www.mushroom.world/data/fungi/Boletusedulis3.JPG", "http://www.mushroom.world/data/fungi/Boletusedulis4.JPG", "http://www.mushroom.world/data/fungi/Boletusedulis5.JPG", "http://www.mushroom.world/data/fungi/Boletusedulis6.JPG"], "description": "Cap 8–20(30) cm; stem 6-8 cm tall * 2-4 cm diameter. This is a large, robust bolete with dull brown cap, dirty white pores and stout and swollen stem. It has a white net over upper stem. It is a very popular, delicious, meaty mushroom that grows almost all over the world.\n\nCap convex in shape when young and flattens with age, color is quite variable from light brown to reddish brown. Flesh white, unchanged when cut or bruised. The pore layer is quite hard when young and white changing to yellowish then to pea soup green to greenish brown becoming fairly soft at maturity. Tubes white at first, slowly becoming greyish yellow to olive-brown. Stem Very thick and club shaped and usually finely reticulated meaning it has a net shaped raised pattern on the surface. The reticulation is most pronounced near the top. The color can vary from whitish cream to reddish brown. It can become cylindrical at maturity. Ring absent. Interior solid.\n\nSimilar species Boletus variipes has a dry, tan cap and grows with oak; Tylopilus felleus is similar when young but tastes bitter and is thus inedible.\n\nBoletus edulis on the First Nature Web site.", "edibility": "edible and excellent "},
{"name_latin": "Boletus badius", "name_eng": "Bay Bolete", "url": "http://www.mushroom.world/show?n=Boletus-badius", "img_urls": ["http://www.mushroom.world/data/fungi/Boletusbadius1.JPG", "http://www.mushroom.world/data/fungi/Boletusbadius2.JPG", "http://www.mushroom.world/data/fungi/Boletusbadius3.JPG", "http://www.mushroom.world/data/fungi/Boletusbadius4.JPG", "http://www.mushroom.world/data/fungi/Boletusbadius5.JPG", "http://www.mushroom.world/data/fungi/Boletusbadius7.JPG"], "description": "Cap 4-14 cm diameter, stem 4-12 cm tall * 1-4 cm diameter. This is a large bolete with bay-brown cap and lemon-yellow pores bruises distinctively bluish green. It grows in coniferous or mixed woods on the ground or on decaying tree stumps.\n\nCap chestnut to dark brown, sometimes with brick-red or ochre tinges; almost spherical in young specimens before broadening and flattening out. It is at first downy, becoming smooth and polished, somewhat sticky when damp. Flesh is white or lemon-yellow. Where cut, it becomes faintly blue. Pores are initially cream to pale yellow, but become greenish yellow or olive with age. Stem  is similar in colour to the cap but paler, and sometimes with a rose-coloured tinge and relatively slim and cylindrical (compared to  many other boletes). The mushroom has no ring.\n\nSimilar species Boletus edulis has a barrel-shaped stem with white net patterning.\n\nSynonyms Synonyms of Boletus badius include Imleria badia, Ixocomus badius and Xerocomus badius.\n\nImleria badia on the First Nature Web site.", "edibility": "edible and good "}]
